[{"id": "2024-03-19_Cindy_Glenn", "date": "2024-03-19", "first_name": "Cindy", "last_name": "Glenn", "association_with_bsd": "Other Community Member", "sentiment": "Positive", "topics": ["library services", "literacy achievement", "staff compensation", "reclassification"], "comment": "School library studies show a positive correlation between the literacy achievements of students in schools with school librarians. Students who read for pleasure are more likely to achieve greater academic success in school than students who don't. Research shows that if there is a librarian working with classroom teachers, student achievement is higher. Librarians are uniquely positioned to inspire students to read.\nAs a retired teacher-librarian of 24 years, I know this job is SO much more than checking out and shelving books. Librarians are the backbone of a school's success in creating life-long learners. They know the books within their collection that can turn kids onto reading. They are not\"assistants\". They are \"librarians\". I hope the Beaverton School District will reclassify this position and provide the deserved and already earned financial support for this vital position.\nRespectfully,\nCindy Glenn\n"}, {"id": "2024-03-19_Oleg_Sidorov", "date": "2024-03-19", "first_name": "Oleg", "last_name": "Sidorov", "association_with_bsd": "Parent/Guardian", "sentiment": "Negative", "topics": ["school schedules", "Sato Elementary", "early start", "student petition"], "comment": "Hello,\nMany Sato elementary school families are concerned about the BSD decision to make Sato an early start school.\nMy daughter [name] and her friend [name] started an initiative to revert the school schedule back to the late start.\nI have helped them by starting a petition on change.org that currently gathered more that 200 supporters within Sato community. [link]\nMy daughter [name] and her friend [name] would like to present their case during the upcoming board meeting.\nThank you very much,\nOleg.\n"}, {"id": "2024-03-19_Gayathri_Ramadurai", "date": "2024-03-19", "first_name": "Gayathri", "last_name": "Ramadurai", "association_with_bsd": "Parent/Guardian", "sentiment": "Positive", "topics": ["library services", "staff compensation", "position review", "wage increase"], "comment": "We love our school libraries and greatly appreciate the efforts of our Library staff towards the upliftment of our student community. We extend our support towards their campaign towards position review and increase in wages to help make their positions more sustainable. Thank you!\n"}, {"id": "2024-03-19_Cherise_Arthur", "date": "2024-03-19", "first_name": "Cherise", "last_name": "Arthur", "association_with_bsd": "Other Community Member", "sentiment": "Negative", "topics": ["student discipline", "equity concerns", "school safety", "security procedures", "special education"], "comment": "I recently was listening to a school board meeting where there was a discussion about issues related to student discipline. As a former employee who worked in public safety for close to 18 years I wanted to share my concerns with school related issues and discipline. Many schools are doing well with dealing with issues but there does not seem to be equity and consistency within the district about discipline and how it is being applied towards our students. I saw in the last two years less students being suspended for drugs, alcohol and smoking at school. We had SPED students who attacked other students and staff and were allowed back in the building when staff and students did not feel safe. The District needs to abide across the board at every school they same discipline for regular education students. Security staff should have access to information when STAT reports are done on students who have been violent. Staff and student need the support of district on these issues.\n"}, {"id": "2024-03-19_Jamie_L", "date": "2024-03-19", "first_name": "Jamie", "last_name": "L", "association_with_bsd": "Parent/Guardian", "sentiment": "Positive", "topics": ["library services", "staff compensation", "librarian recognition"], "comment": "I am in support of our librarians earning a livable wage. They work so hard and are the unsung hero's of our school. Many work underfunded, under compensated and under appreciated. I am submitting my support for our school librarians. Thank you for reading.\n"}, {"id": "2024-03-19_Leela_Prakash", "date": "2024-03-19", "first_name": "Leela", "last_name": "Prakash", "association_with_bsd": "Student", "sentiment": "Positive", "topics": ["library services", "librarian impact", "student experience", "reading"], "comment": "Librarians are kind and hard working and are important in schools. They do so much for kids and my mom and my school librarian do a lot of things to make kids happy and are a big part of everyones day. They make the library a beautiful and relaxing place for kids to enjoy. They teach me about new people and places I've never heard of. I feel calm in the library and can learn with my friends. I love read alouds and learning how to take care of books and how to find different kinds of books to read. With my librarians help I did OBOB and made it far at my school competition. I can tell my librarian how much I appreciate them and that makes them feel good. If you pay them more for all they do for us that would make them feel good too. Thank you [name] for all you do. From Leela, age 10, 4th grade, Fir Grove.\n"}, {"id": "2024-03-19_Sara_Davis", "date": "2024-03-19", "first_name": "Sara", "last_name": "Davis", "association_with_bsd": "Parent/Guardian", "sentiment": "Positive", "topics": ["library services", "staff compensation", "librarian roles", "livable wages"], "comment": "We need to do better for our District Library Media Assistants. Their current wage is not a livable wage, nor does it match up with the amount of work they do. I have first hand seen how hard they work and how much they support our students. Reading is important and library staff to support kids in this endeavor is vital. Please consider increasing their wages and also providing support staff to them. While they may not be considered \"teachers\" and are not in the same union, they are teachers and support our students in very much the same way. Please consider increasing their wages to a livable wage. They are valuable to our children and our future.\n"}, {"id": "2024-03-19_Crystal_G", "date": "2024-03-19", "first_name": "Crystal", "last_name": "G", "association_with_bsd": "Staff Member", "sentiment": "Positive", "topics": ["library services", "staff compensation", "librarian roles", "job titles"], "comment": "Our LMA's (an important job with a misleading title) serve an important role in our schools. [Name], the LMA for Nancy Ryles works tirelessly to foster a love of reading in all students, build necessary relationships, and craft lessons to expand students' perspectives and expose them to diverse viewpoints. She does this in addition to maintaining our library space and handling book distribution. When asked to describe [name], students used words like problem solver, wise, helpful, understanding, calm, and kind. This is not the kind of person we want to drive out of schools because they can not afford to live on their salary. All District LMAs, deserve fair compensation for their work. This is not a role that can be replaced easily; it would be an incredible disservice to our students to even consider that. Instead, let's provide the correct title & wages to show the incredible people working in our school libraries that we recognize and VALUE their contributions. Thank you!\n"}, {"id": "2024-04-30_Dr. Sumit_Mehotra", "date": "2024-04-30", "first_name": "Dr. Sumit", "last_name": "Mehotra", "association_with_bsd": "Parent/Guardian", "sentiment": "Negative", "topics": ["bus service", "student safety", "transportation", "walking routes"], "comment": "At Oct'23 board meeting & BSD Engage, parents submitted request for bus service to south of Sato within 1 mile.\n1. Walking to school from south of Sato is not safe for kids walking alone. Several near miss accidents witnessed by various parents.\n2. Current pathways involve crossing the busy roads (159th & Brugger; Kaiser & Ernst St). Walkway along the Kaiser with no physical barrier is very risky.\n3. Parents are suffering with work time loss as must accompany kids to school due to unsafe walking conditions.\n4. Walking bus doesn't work with the large group without enough volunteers and barrier protection along kaiser road. Parents as volunteer does not work.\nParents request is to either add bus to the south of Sato within 1 mile, or atleast add school staff volunteers at (159th & Brugger; and Kaiser & Ernst) and recommend county to install a physical barrier all along the kaiser road for kids' safety. Parents should be able to leave kids walking from their home on a safe walkway.\n"}, {"id": "2024-04-30_Elizabeth_Schulz", "date": "2024-04-30", "first_name": "Elizabeth", "last_name": "Schulz", "association_with_bsd": "Staff Member", "sentiment": "Negative", "topics": ["insurance benefits", "healthcare costs", "staff compensation", "employee retention"], "comment": "AsanemployeeofBSDfor20yearsandparenttochildrenattendingBSDschools;IwouldliketodiscusstheSIGNIFICANTchangestoourinsurancecoverageandrates.Health insurancebenefitshavealwaysbeenasellingpointfornewemployeesaswellasretaining employmentforcurrentstaff.IstronglyencouragetheBoardtomakeapromptdecisionto increasetheinsurancecapPRIORtoourMay31deadline.Noonemakingafinancial decisionshoulddosoWITHOUTALLofthefactsTheproposedRegenceoptions informationwehaveregardstoprescriptioncoverageisMACAWhatdoesthat mean?Our benefitsaretheONLYbenefitsequalamongAdminCertifiedandClassifiedstaff.While mostAdminwon'thavedifficultypayingthehigherdifferenceinpremiumwithourAMAZINGbenefitsortheridiculouspremiumsandHUGEoopincreasethatthe proposedwillensue.OurleastpaidstaffwillhavetochooseiftheycanAFFORDtostayemployedinBSDIfteachers cannotaffordtogotothedoctorbecauseofcostly deductiblestheywillcometoschoolsickandotherswillgetsickortheywillbeforcedtostayhomeleavingstudents withaSubifthereareenoughOURSTUDENTSfutureis at risk.\n"}, {"id": "2024-04-30_Anne_Conner", "date": "2024-04-30", "first_name": "Anne", "last_name": "Conner", "association_with_bsd": "Staff Member", "sentiment": "Negative", "topics": ["school facilities", "construction concerns", "Mountain View Middle School", "building conditions", "modernization"], "comment": "It is very disheartening that Mountain View Middle School will be having construction for the next two years and yet very little modernization will actually be happening. We are now being told that we will only be getting seismic upgrades, solid walls, and new ceiling tiles. In the meantime, all teachers will have to pack up their classrooms, move rooms, and some will be in portables next year and the year after. The PE Department will be without several spaces. We have asbestos in the walls, carpets are stained and likely have mold in them, wood paneling everywhere, barely any natural light, water that tastes like dirt, fake whiteboards, etc. Mountain View staff are very dedicated and our students deserve to have a nice school to go to. Many staff members, students, and community members see the improvements around the district and feel forgotten about. It would be nice for the district to put some money towards making our school a safe and inviting place to be.\n"}, {"id": "2024-04-30_Becky_Reichard", "date": "2024-04-30", "first_name": "Becky", "last_name": "Reichard", "association_with_bsd": "Other Community Member", "sentiment": "Positive", "topics": ["library services", "literacy", "staff quality", "staff compensation"], "comment": "As a former BSD parent and public librarian who partnered with BSD school libraries, I can attest to the need for consistent, quality school library staff. While the public library is the door to preschool literacy, the school library supports school age literacy. The role and value of school libraries in building literacy cannot be overstated. This is why reading scores are higher in schools with library programs. It's not just reading to kids, even though that is extremely important. It is knowing the literature, how to present it, how to make it accessible, how to embed it into students' lives so they see the relevance and importance and personal satisfaction of learning. You cannot achieve this with a revolving door of library staff. This requires people with education and the ability to build student relationships and know their libraries intimately. It requires an educated, quality staff that is fairly compensated who retains their position. BSD, make the choice for libraries!\n"}, {"id": "2024-04-30_Dianna_H", "date": "2024-04-30", "first_name": "Dianna", "last_name": "H", "association_with_bsd": "Staff Member", "sentiment": "Negative", "topics": ["insurance benefits", "healthcare costs", "staff compensation", "bargaining", "enrollment deadline"], "comment": "Please encourage those representing BSD in bargaining with BEA and OSEA to share their proposed increase in the Employee Insurance Cap or confirm no increase close to the May 1st open enrollment date and certainly before May 31.\nMany low-paid staff are stressed due to changes in insurance plans for 24-25, facing tough choices between low initial pre-tax deductions/high deductibles or high employee pre-tax deductions to keep plans similar to last year's. This effectively reduces funds for essential needs like medication, medical care, mental health care, food, and/or rent. Please urge the decision-makers to expedite the process, as the open enrollment period begins 5/1.\nThis is essentially a pay cut to so many employees that can't afford it. We ask that you give a little nudge to the decision makers where you can, to hurry this along.\n"}, {"id": "2024-04-30_Yun-Pei_Tu", "date": "2024-04-30", "first_name": "Yun-Pei", "last_name": "Tu", "association_with_bsd": "Parent/Guardian", "sentiment": "Negative", "topics": ["school boundaries", "Summa program", "TAG students", "school options"], "comment": "After the change of school boundaries two years ago, many good students were forced to leave BSD for better school environments. Here, I would like to propose a plan for sending our kids to the Summa program held by Tumwater Middle School instead of Meadow Park. The BSD Board has the authority to decide this matter.\nReasons list below:\n1. Tumwater just started the Summa program, and it is possible to include more students. There are only 4 and half schools that feed the Summa program in Tumwater. However, there are 9 and half schools that feed to Meadow Park. Bethany has 4-6 Summa students each year.\n2. Bethany Elementary School loses the battle of the change of school boundary which made our students force to do the lottery of option schools, go to private schools or even let the family to move out of the neighborhood.\n3. No school bus route problems for Summa students.\n4. Stoller Middle School does not have enough capacity to accept more students due to crowded Tag classes.\n"}, {"id": "2024-04-30_Janet_Poulos", "date": "2024-04-30", "first_name": "Janet", "last_name": "Poulos", "association_with_bsd": "Staff Member", "sentiment": "Positive", "topics": ["library services", "staff compensation", "equity", "student achievement"], "comment": "As a BSD teacher/parent, I'm shocked that BSD Library Media Assistants are paid so little they rely on food stamps. Please consider that LMAs\n• earn less than BSD bus drivers, Para 1s & 2s.\n• plan/teach lessons to all grade levels every week.\nUnlike Para 1s/2s, but like certified staff, LMAs\n• teach entire classes\n• are responsible for students in emergency situations.\n• must plan their own lessons, without guidance from a certified staff.\nAt the March 19 school board meeting (video minutes 19:48–21:50) SATO LMA Tammy Frye spoke of studies which proved that qualified library programs\n• increase scores on standardized tests & student achievement\n• increase graduation rates of low income students, students of color & those with disabilities\n• double advanced writing scores\n• increase elementary math scores\nIf BSD truly wants to promote equity, BSD LMAs should receive wages on which they can live, without food stamps. Please compensate them accordingly & value their work!\n"}, {"id": "2024-04-30_Barbara_Weiss", "date": "2024-04-30", "first_name": "Barbara", "last_name": "Weiss", "association_with_bsd": "Staff Member", "sentiment": "Negative", "topics": ["special education", "paraeducators", "staff compensation", "working conditions", "insurance benefits"], "comment": "I have also mailed a letter to the Board, which I truly hope you read. This is my conclusion to that letter: As you get involved with bargaining for insurance premium caps, wages, etc., please remember how hard your classified staff work in BSD's special education classrooms. How vital they are to the running of these rooms. How it impacts their day when the classrooms are understaffed (we have to watch for and deal with seizures, do tube feeds, monitor or feed students with feeding protocols, deal with aggressive behaviors, change diapers, etc., in addition to working on IEP goals). How frequently they feel unappreciated and sometimes unseen by school administration. How expensive it is to live in today's world, and how their absence would impact the schools if they felt the need to find alternate employment. I have been a paraeducator II for 20 years with BSD. Thank you in advance for listening to comments from classified staff.\n"}, {"id": "2024-04-30_Yihsun_Yang", "date": "2024-04-30", "first_name": "Yihsun", "last_name": "Yang", "association_with_bsd": "Parent/Guardian", "sentiment": "Negative", "topics": ["bullying", "TAG students", "school boundaries", "Summa program"], "comment": "There is an ongoing problem with bullying within the Five Oak MS based on https://www.greatschools.org/. Additionally, I am deeply concerned about the well-being and support provided to our TAG students from Bethany ES.\nTAG students are often targeted for several reasons. Firstly, their exceptional academic performance draws attention, resources, and opportunities. Unfortunately, this success can make them susceptible to bullying. Some bullies may be envious of their achievements, while others perceive them as a threat to their own status and academic success.\nBethany ES is the top performing ES and FiveOaks MS is the lowest performed in BSD academic. By Placing Summa students from Bethany ES to Tumwater MS has minimum impact to the middle school loading and adds no commute burden to the parents. Distance from Bethany to Tumwater and Bethany to MeadowPark is within 10% difference. TAG students are placed with closer academic level helps reducing the issue forementioned.\nSincerely,\nYY\n"}, {"id": "2024-04-30_Tina_Garcia", "date": "2024-04-30", "first_name": "Tina", "last_name": "Garcia", "association_with_bsd": "Staff Member", "sentiment": "Negative", "topics": ["athletic trainers", "staff compensation", "job recognition", "healthcare professionals"], "comment": "The athletic trainers have been overlooked by the district for almost 2 decades. In the 17 years of our job's existence in BSD, we've not once been considered for job betterment or improvement wages or otherwise. When the school district conducted Trupp studies, they didn't even include the athletic trainers' position! We are told we must work on non contracted days without pay and without accruing flex time purely because we are \"exempt\". We save BSD millions in liability and lawsuits, we save the district losses of instructional time as students do not have to miss class to go to ERs, doctors, &/or PT clinics, and for us to be overlooked as a profession is the highest form of disrespect. We are licensed health care professionals and are severely underpaid compared to our neighboring school district colleagues. BSD has 5 National award winners, 1 sits on the National & state sports med advisory commmittees. BSD ATs set the bar for others, it's time to compensate us for our expertise.\n"}, {"id": "2024-05-28_Mitzi_Sandman", "date": "2024-05-28", "first_name": "Mitzi", "last_name": "Sandman", "association_with_bsd": "Other Community Member", "sentiment": "Negative", "topics": ["school rebuild", "facility planning", "enrollment decline", "capacity concerns"], "comment": "I ask the Board to change the scope of the RH rebuild from the current 770-capacity K-5 plan. In BSD Long-Term Facility Planning report: APPROACH B:\"A strategy for addressing areas of lower enrollment is to replace all school facilities but at a reduced size & capacity that aligns with projected enrollment. Facilities would be designed to expand to the target capacity of 750 students in the future if needed.\" When the 750-capacity school was set as the standard in 2013 BSD was growing w/ 40K students. Current enrollment is 38K & predictions for 2032 are 31K–35K. Ground breaking hasn't started yet at RH. Before it's too late I urge you to follow APPROACH B & revise the architectural & structural plans to a smaller school that can be expanded in the future. Most of you weren't in your position when past decisions were made, but you now hold the authority AND the responsibility to do the right thing, for our students, the community, and w/ the public dollars entrusted to your oversight.\n"}, {"id": "2024-05-28_Paul_Blechschmidt", "date": "2024-05-28", "first_name": "Paul", "last_name": "Blechschmidt", "association_with_bsd": "Parent/Guardian", "sentiment": "Negative", "topics": ["school rebuild", "traffic concerns", "safety", "capacity concerns"], "comment": "am very concerned about the Raleigh Hills school rebuild to be nearly triple the capacity of the current school. RH is located on the already over-crowded Scholls Ferry road in a place that's too dangerous for students to walk or bike to school. Has a traffic impact study been done to measure the anticipated additional school bus and car traffic on that road and the nearby \"Six Corners\" intersection of Scholls and BHH? Significantly increasing the traffic in these areas is a terrible idea. As a community member, former BSD parent, and taxpayer, I urge you to ensure that the proper studies have been done on the impact of this rebuild on the neighborhood safety. I can't imagine that significant changes to the Scholls Ferry Road won't be required if the rebuild goes ahead at the current 750+ plan.\n"}, {"id": "2024-05-28_Antonia_Alvarez", "date": "2024-05-28", "first_name": "Antonia", "last_name": "Alvarez", "association_with_bsd": "Parent/Guardian", "sentiment": "Negative", "topics": ["school closures", "mental health", "LGBTQIA2S+ concerns", "community schools"], "comment": "My child attends Raleigh Park Elementary school, and I am writing to express my concern about the potential closure of the school. As a licensed social worker, social work educator, and a researcher focusing on mental health, suicide and substance abuse prevention among youth and BIPOC communities, I have concerns about the unintended consequences of moving Raleigh Park students to a larger school. As a member of the LGBTQIA2S+ community and the AA/PI communities, the intersections of race, sexual orientation/gender identity and school safety and connectedness are of particular concern.\nThe role of a school in the safety, connectedness, and academic success of the students who attend must also be considered. Small, community schools better meet the mental, emotional, behavioral health needs of the students, while also supporting more differentiated learning opportunities. My son and our family have greatly benefitted from the affirming, connective environment Raleigh Park provides.\n"}, {"id": "2024-05-28_Brooke_Arroyo Garcia", "date": "2024-05-28", "first_name": "Brooke", "last_name": "Arroyo Garcia", "association_with_bsd": "Parent/Guardian", "sentiment": "Neutral", "topics": ["special education", "online learning", "funding", "resources"], "comment": "I was told by the BSD FLEX ONLINE SPED Resource, that flex online elementary Beaverton is losing their funding for SPED support. As a parent with a special education student, I need to know what and who I will be able to rely on within the flex online school to get SPED resources for my elementary age child next year as there is no current SPED resource available for next year.\n"}, {"id": "2024-05-28_Sarah_Parr", "date": "2024-05-28", "first_name": "Sarah", "last_name": "Parr", "association_with_bsd": "Staff Member", "sentiment": "Negative", "topics": ["mega schools", "community values", "equity concerns", "transparency", "bond funds"], "comment": "Dear Board Members,\nBSD prides itself on community and equity. Yet, proposed plans for a mega school contradict these values, neglecting safety and community bonds. I was ecstatic to vote for a measure that promised that \"projects ... distributed throughout the District to the greatest extent possible,\" and improve Title 1 schools. Yet, the lack of transparency regarding consolidation in the 2022 bond raises concerns about future bonds and resource distribution, especially when closures were drafted in 2019. Why offer scenarios where low-income, at-risk schools consistently face closure?Is saving $4.8 million worth sacrificing diverse, established communities in the face of a 67 million Goliath? Consider the impact on families without stable transportation or those navigating buses and traffic around it. Your decision will shape Oregon's educational landscape. Please prioritize impacted communities, acknowledge the privilege, and seek a compromise that preserves community integrity.\n"}, {"id": "2024-05-28_Carol_Powers", "date": "2024-05-28", "first_name": "Carol", "last_name": "Powers", "association_with_bsd": "Other Community Member", "sentiment": "Neutral", "topics": ["pause on school changes", "educational specifications", "capacity concerns", "school design"], "comment": "I am currently very involved with Raleigh Park elementary through a close relationship with a family with three students at that school. I applaud the district for the \"pause\" on further discussions/votes about changes related to opening the new Raleigh Hills elementary school. I think this was a wise move on your part.\nRelated to that topic, I attended the PTO meeting at RP last week and there was much discussion about the \"Educational Specification\" adopted by the district in 2013 that specifies 750 as the target size for new elementary schools. This, of course, has driven the new RH design (not to mention Vose, etc. before that). I have read through this document and see no justification for how this 750 figure was chosen. I would like to understand this better.\nI am also a past BSD parent (Terra Linda, Meadow Park, Sunset) and past/current grandparent (Cedar Mill, Cedar Park, Sunset, and Jacob Wismer, Stoller, Westview).\n"}, {"id": "2024-05-28_Emily_Zein", "date": "2024-05-28", "first_name": "Emily", "last_name": "Zein", "association_with_bsd": "Staff Member", "sentiment": "Negative", "topics": ["school safety", "police in schools", "staff compensation", "student support"], "comment": "BSD schools do not need police officers. They need trained educators, counselors, and support staff who can build relationships with students to strengthen our community.\nAs a staff member I would feel less safe with police in the building. It sends a violent message to students. And does nothing to support student growth and development.\nNo funds to police officers in school while you are already under paying the staff members who are face to face with students in a daily basis.\n"}, {"id": "2024-05-28_Karin_Stark", "date": "2024-05-28", "first_name": "Karin", "last_name": "Stark", "association_with_bsd": "Parent/Guardian", "sentiment": "Negative", "topics": ["bond transparency", "mega schools", "trust concerns", "school consolidation", "community schools"], "comment": "The 2022 bond stated that, if approved, the money would be used to rebuild Raleigh Hills and renovate existing schools. On May 13th, we learned that that was not the whole truth. BSD kept some key information from voters because it knew that they would not have approved closure of community schools. On May 22, BSD said they would pause the discussion on school consolidation. BSD expects voters, families, and educators to believe that their voices will be heard while the discussion is paused AND a mega school is built. You have lost our trust. We do not believe that once RH is resurrected as a mega school, our community schools will be safe, that the district will listen to parents, educators and student success researchers. SHOW US NOW that you will listen by halting the Raleigh Hills Replacement construction until a transparent, shared-decision making process has been implemented.\n"}, {"id": "2024-05-28_Wolverton_Emily", "date": "2024-05-28", "first_name": "Wolverton", "last_name": "Emily", "association_with_bsd": "Parent/Guardian", "sentiment": "Negative", "topics": ["facilities planning", "communication concerns", "transparency", "school consolidation", "community engagement"], "comment": "I am a Fir Grove parent and want to express disappointment at how the district handled the Facilities Planning Committee scenarios earlier this month, especially for the Fir Grove community by trying to call off concerns/questions/follow up by saying something is \"not true\"in the Oregonian, but not quite giving us the accurate picture or addressing what was in an article that was behind a paywall, and in addition, what was in a document that is readily available on a BSD website/ letterhead (that one scenario outlined a consolidation with Hiteon). We know our school building isn't in great shape and enrollment in our boundary is declining - the building has been marked for \"nearing the end of its useful life\"- we get it! But the Fir Grove community is extremely tight knit, and I think we could get on board with a plan for our school's future and feeder school path alongside the district if we were brought along for the ride. Hopefully we will have that opportunity.\n"}, {"id": "2024-05-28_Alice_K", "date": "2024-05-28", "first_name": "Alice", "last_name": "K", "association_with_bsd": "Parent/Guardian", "sentiment": "Negative", "topics": ["school size", "student success", "capacity concerns", "small schools"], "comment": "As a BSD parent an classified/certified substitute, I have had the privilege to work in various schools. Every school I have been in has wonderful staff doing their absolute best. However I have often noticed that the larger schools have more struggles. I strongly urge BSD to consider their alternate long-term plan that builds smaller elementary schools and veers away from planned 750 capacity schools so that we can find the \"sweet spot\" between fiscal efficiency and maximizing student success.\n"}, {"id": "2024-05-28_Samantha_Deitch", "date": "2024-05-28", "first_name": "Samantha", "last_name": "Deitch", "association_with_bsd": "Parent/Guardian", "sentiment": "Negative", "topics": ["school closures", "school consolidation", "community concerns", "mega schools"], "comment": "We are devastated to hear that BSD is considering closing smaller schools to consolidate elementary students into one mega school. The thought of losing the community we have at Montclair is unthinkable and I am alarmed by the size, the distance, and the location of Raleigh Hills after the rebuild. Please consider other, better options.\n"}, {"id": "2024-05-28_Elizabeth_Ranweiler", "date": "2024-05-28", "first_name": "Elizabeth", "last_name": "Ranweiler", "association_with_bsd": "Parent/Guardian", "sentiment": "Negative", "topics": ["school rebuild", "mega schools", "community schools", "bond transparency", "capacity concerns"], "comment": "Please consider immediately pausing construction of a mega elementary school for 700+ students at the Raleigh Hills Elementary site and choosing one of the options to construct a smaller school instead. There is considerable community opposition to the current plan to construct a mega elementary school in that location, in part because the plan to close small community elementaries and bus students to fill a mega elementary at Raleigh Hills was not disclosed to voters prior to voter approval of the 2022 bond measure.\nI voted yes on the 2022 bond measure. If the district had disclosed that the bond money would be used to construct mega elementaries and close existing small elementaries, I would have voted no on the bond measure. Many other Beaverton voters feel the same.\nSuperintendent Balderas has informed community members that you, the School Board, have the final say in the matter, so I am reaching out to you. I have also reached out to the Bond Accountability Committee.\n"}, {"id": "2024-05-28_Jeff_Myers", "date": "2024-05-28", "first_name": "Jeff", "last_name": "Myers", "association_with_bsd": "Parent/Guardian", "sentiment": "Negative", "topics": ["student data", "privacy concerns", "testing", "assessment", "federal compliance"], "comment": "Hello board directors. I want to share two concerns with the district's pilot of universal screeners (math, reading, and social emotional behavior assessments) with Renaissance Learning.\nThe first issue has to do with student data and who has access to it. I reviewed Renaissance Learning's privacy policies, and even reached out to them for clarification. From what I understand, Renaissance is allowed to use our student's data for further research, product enhancements, etc. That sounds benign, but Renaissance staff from other countries (i.e. China) can use the data. Anonymizing the data may protect an individual's identity, but this is still a huge concern. We should either stop using Renaissance or ensure BSD student data is protected from going overseas.\nMy second concern is about the need for parent/guardian notification before conducting the social emotional behavior screener and providing an opt out. This is required by federal law (PPRA). See: https://studentprivacy.ed.gov/\n"}, {"id": "2024-05-28_Claire_Douglass", "date": "2024-05-28", "first_name": "Claire", "last_name": "Douglass", "association_with_bsd": "Staff Member", "sentiment": "Negative", "topics": ["school closures", "school consolidation", "small schools", "community schools", "equity concerns", "research"], "comment": "Hello,\nI am writing to you as a teacher at McKay. I want to ask that you slow down the district decision makers when it comes to closing our school and consolidating. I ask that you look into educational research around small community based schools before making such a drastic decision. I could write to you about the benefits of our small school or about equity concerns when it comes to asking our families to travel further to school (some without transportation) and behavior spiking in larger schools. These are all huge factors that I know others are covering so instead I ask you to consider the academic piece to our small title school. Attendance has been a huge issue in schools since Covid and one our school is tackling. We know every child and make sure they feel seen, are a valued part of a community and have a trusted adult at school. When kids come to school they perform better, they graduate! Important work is being done in our school, please come visit!\n"}, {"id": "2024-05-28_Tom_Douglass", "date": "2024-05-28", "first_name": "Tom", "last_name": "Douglass", "association_with_bsd": "Other Community Member", "sentiment": "Negative", "topics": ["school consolidation", "bond transparency", "equity concerns", "small schools", "community schools"], "comment": "Hello,\nI'm writing on behalf of the plans to consolidate schools upon the rebuild of Raleigh Hills. I voted for the bond as a community member and former parent in the district. I feel like I was lied to and not given the full picture as to what my vote would result in. I do not support the closing of schools to create bigger schools. These small schools are the epicenters to communities. I also noticed that McKay, a title school is closed in all 8 scenarios. This feels inequitable and to not follow the districts mission. Having these families lose the center of their community to travel further, some without transportation to attend evening events or pick up a sick child seems to provide disproportionate harm to our most marginalized communities. As a community member, and voter on future bonds, I ask that you pause the rebuild of Raleigh Hills and devote funds to our small schools. This is an important precedent I ask you to set for the future of the district.\n"}, {"id": "2024-05-28_Rina_Miyamoto-Sundahl", "date": "2024-05-28", "first_name": "Rina", "last_name": "Miyamoto-Sundahl", "association_with_bsd": "Staff Member", "sentiment": "Negative", "topics": ["American Indian education", "staffing concerns", "SB13 implementation", "curriculum", "funding"], "comment": "I am writing to express my concert about the defunding of the position of American Indian/Alaska Native Education TOSA, which has been occupied by [name]. I am one of the teachers that [name] has been organizing to train staff in each building for Senate Bill 13 Tribal History/Shared History curriculum implementation, among many others. My understanding is that there is still a 2 year timeline left in order to even complete the trainings of staff on the Essential Understandings - that is to say, the teacher background. I am baffled at the decision to cut this position, as it leaves teachers without support or facilitation of trainings. Senate Bill 13 is a legal mandate for Oregon. Already, I know that many schools are not fully in compliance - not because of a lack of will, but because of insufficient teacher background. These trainings have been incredibly important. The district must find a way to continue to fund this important position and comply with Oregon state law.\n"}, {"id": "2024-05-28_Talya_Sanders", "date": "2024-05-28", "first_name": "Talya", "last_name": "Sanders", "association_with_bsd": "Parent/Guardian", "sentiment": "Negative", "topics": ["school rebuild", "mega schools", "community input", "capacity concerns", "planning"], "comment": "You should immediately pause the rebuild of Raleigh Hills Elementary — do not begin demolition and construction there in June. There are several alarming elements that have come to light in the recent conversations about how to populate the new 750-student building. BSD and the community need to do important research and have critical conversations, now scheduled to begin in the fall. If you start construction on Raleigh Hills this summer, you'll be eliminating options without ever giving them a chance.\nThe biggest question is, how do 750-student mega-schools best serve our students and communities? Why do you think your mega-school solution is the best solution for all neighborhoods? The district needs to rewrite the Ed Specs so each community can have the school design that meets its needs.\nIf you move forward with the Raleigh Hills construction, you force decisions that will change the district for the next several decades and forever change our neighborhoods.\n"}, {"id": "2024-05-28_Sandy_Douglass", "date": "2024-05-28", "first_name": "Sandy", "last_name": "Douglass", "association_with_bsd": "Other Community Member", "sentiment": "Negative", "topics": ["school consolidation", "bond transparency", "community schools", "mega schools", "academic achievement"], "comment": "Hello,\nI'm a former teacher of BSD at the high school level, a former BSD parent and current community ever. I am so disappointed to see the consolidation plans regarding the opening of the new Raleigh Hills. I voted for the bond to improve our schools, provide title schools more supports and create an equitable experience for all our students. I don't feel that what I voted for is being held in good faith by these plans. Small elementary schools are crucial to their communities. Closing these down with plans to consolidate to a \"mega\" school does not follow current educational research. The districts mission is \"belong, believe achieve\". I believe students experience a much greater sense of belonging in small schools within their community where all staff know them! I believe students at small schools stand a much better chance of academic achievement at small schools especially students who fall below the poverty line and need extra supports. Please reconsider this plan!\n"}, {"id": "2024-05-28_Geena_Van Buren", "date": "2024-05-28", "first_name": "Geena", "last_name": "Van Buren", "association_with_bsd": null, "sentiment": "Negative", "topics": ["school consolidation", "small schools", "community schools", "mega schools", "equity concerns"], "comment": "I am a current community member, former student of BSD and plan on sending my future children to BSD schools. Therefore I supported the previous bond. However, with the recent news of consolidating elementary schools I am very disappointed in the direction the district is heading. I believe that elementary students should be able to attend small neighborhood schools. They will have their time to be at \"mega\" schools in middle and high school but that is not what elementary is for. This should be a time for students to build a solid academic foundation and feel like a member of a community. They should feel seen and known by staff in a school and not just be a number. They should know the other students at their grade level, walk to school with neighbors and attend evening events. This is not possible at mega schools out of children's neighborhoods. This does not feel equitable to our students at title schools like McKay especially. Please reconsider this direction.\n"}, {"id": "2024-05-28_Michele_Bell", "date": "2024-05-28", "first_name": "Michele", "last_name": "Bell", "association_with_bsd": "Staff Member", "sentiment": "Negative", "topics": ["school consolidation", "school size", "student behavior", "community schools", "equity concerns", "family engagement"], "comment": "I am writing to urge you to reconsider the size of the Raleigh Hills Elementary and closing several small elementary schools. I have taught in BSD in 2 large schools (Vose & Springville) and 2 small (McKay and Greenway). Teaching in small schools brings a special experience that the big schools cannot: the staff knows all of the students. Teachers see ALL students as their own & work to support students who are no longer in their grade level. This results in better stuednt behavior compared to large schools.It also allows the staff to know the families, providing a welcome space to poor, diverse & marginalized families. In schools like McKay, many parents do not drive but will walk to school events. Moving these families further away will decrease parent participation. Decreased interaction with families will also result in needs being overlooked and fallen thru the cracks (hurting the children). Teacher collaboration is stronger in small teams of 2 teachers than in teams of 4-6.\n"}, {"id": "2024-05-28_Sarah_Goldhammer", "date": "2024-05-28", "first_name": "Sarah", "last_name": "Goldhammer", "association_with_bsd": "Staff Member", "sentiment": "Negative", "topics": ["American Indian education", "staffing concerns", "SB13 implementation", "funding", "curriculum"], "comment": "I am writing to express my concert about the defunding of the position of American Indian/Alaska Native Education TOSA, which has been occupied by [name] My understanding is that there is still a 2 year timeline left in order to even complete the trainings of staff on the Essential Understandings - that is to say, the teacher background. I am baffled at the decision to cut this position, as it leaves teachers without support or facilitation of trainings. Senate Bill 13 is a legal mandate for Oregon. Already, I know that many schools are not fully in compliance - not because of a lack of will, but because of insufficient teacher background.\nThese trainings have been incredibly important. The district must find a way to continue to fund this important position and comply with the Oregon state law.\n"}, {"id": "2024-05-28_Paul_Kirk", "date": "2024-05-28", "first_name": "Paul", "last_name": "Kirk", "association_with_bsd": "Other Community Member", "sentiment": "Negative", "topics": ["school closures", "community schools", "bond transparency", "trust concerns", "communication"], "comment": "I signed the save-our-neighborhood-schools petition I agree with the observations, suggestions and requests regarding school size, community involvement and presence and the avoidance of inequities among the students.\nSadly we live in an age and a society where we have to distinguish real and mis and disinformation on a daily basis and it is disheartening that BSD has been guilty of spreading disinformation regarding the recent bond measure by withholding, either deliberately or negligently vital information about the proposed closure of some elementary schools.\nI give you credit for giving your time and expertise in serving on the board. I do not give your predecessors on the board credit for the way they handled this critically important issue.\nPlease make sure you truly understand your communities' needs and wishes before you start to spend the bond obtained through a deceptive campaign.\n"}, {"id": "2024-05-28_Siobhan_Kirk", "date": "2024-05-28", "first_name": "Siobhan", "last_name": "Kirk", "association_with_bsd": "Other Community Member", "sentiment": "Negative", "topics": ["school rebuild", "construction delay", "community engagement", "planning", "transparency"], "comment": "Please delay the start of the Raleigh Hills \"rebuild\" construction project (including mobilization and demo) to align with \"planned future discussions\" it is imperative that the project timeline allows for additional Community Stakeholder engagement and is coordinated with planned discussions at the start of the next school year. I understand the significance of this request and I don't make it lightly. I am quite sure that while challenging it is a feasible course of action and I am certain the Construction contract will have a suspension clause enabling the District (Owner) to direct the General Contractor to delay the start of Work.\nTaking in to account all critical data (operational, facilities repair and maintenance costs for neighborhood schools under consideration for closure) engage with community stakeholders in a forthright transparent and open process. Complete this process before final decisions regarding neighborhood school closures are made.\n"}, {"id": "2024-05-28_Andrew_Sample", "date": "2024-05-28", "first_name": "Andrew", "last_name": "Sample", "association_with_bsd": "Other Community Member", "sentiment": "Negative", "topics": ["school closures", "bond transparency", "school consolidation", "community schools", "mega schools"], "comment": "To whom it may concern,\nI have been made aware that there is serious talk of McKay Elementary being almost certain to close, and I wanted to speak out against this happening.\nFrom my understanding, the bill that I voted for and that was passed in 2022, was to use $723 million taxpayer dollars to improve EXISTING facilities and rebuild EXISTING schools with the money. What the bill did not disclose, is that it would be shutting down existing schools, and consolidating those closed school students and faculties, into a newly built school with much higher capacity of 750 students.\nAs someone who voted for this bill, I'm quite frankly outraged to hear that schools are being shut down and teachers/students potentially being forcibly moved into much larger school populations. This cannot possibly be beneficial to the students, and as a member of the community, I find the tactics and process surrounding this issue to be disconcerting. The wording on this bill was tactfully misleading.\n"}, {"id": "2024-05-28_Aracelli_Hernandez", "date": "2024-05-28", "first_name": "Aracelli", "last_name": "Hernandez", "association_with_bsd": "Staff Member", "sentiment": "Negative", "topics": ["school closures", "equity concerns", "McKay Elementary", "community schools", "mega schools"], "comment": "Greetings,\nI am writing to bring to your attention to the significant concern regarding the closure of BSD schools that the Facilities Planning Committee has been discussing. In all eight scenarios McKay Elementary is in fact due to close, [name] said himself, \"No other scenarios will be presented.\" With that being decided, McKay staff, students and families are expected to consolidate with three other elementary schools-thus splitting up McKay's community-how is this equitable?I am outraged that a district whose promise is \"Belong, Believe, and Achieve\" is splitting up one of the smallest yet strongest community schools within the district. McKay is strong in its relationships with individual students to ensure their success both academically and emotionally. As a teacher and community member I am very concerned that with MEGA schools being built students will not feel a sense of belonging when staff members don't know their name, with no belief in themselves, no achieving.\n"}, {"id": "2024-05-28_Keri_Bernstein", "date": "2024-05-28", "first_name": "Keri", "last_name": "Bernstein", "association_with_bsd": "Parent/Guardian", "sentiment": "Negative", "topics": ["school consolidation", "planning concerns", "communication", "transparency", "community input"], "comment": "How much of the plan for consolidation of elementary schools is each board member aware of?I would ask you all that if you were not fully aware of these plans would you call for a hold on the building of the new Raleigh Hills school until a more comprehensive plan can be agreed upon. It seems to me as though there have been various plans shoe-horned together over the years without a comprehensive plan. If we need to consolidate schools let's first think about the children and make a plan in their best interest that is also financially responsible. Let's think about the best place for a replacement school and its size. 750 capacity schools are proving in the BSD to be too big. Consolidating 750 students in the SW sector of the BSD will destroy our communities. These small schools are a critical part of our neighborhoods. If we are going to loose our schools I would appreciate it being well thought out and in the best interest of the children.\n"}, {"id": "2024-05-28_Lauren_Kelly", "date": "2024-05-28", "first_name": "Lauren", "last_name": "Kelly", "association_with_bsd": "Parent/Guardian", "sentiment": "Negative", "topics": ["school closures", "school consolidation", "community schools", "school capacity", "planning"], "comment": "No doubt you will be receiving many comments about the recent news to close/consolidate schools in the SE part of the district. I am a parent of a current kindergartner at McKay with a second child who will be entering pre K in the fall. We love McKay elementary and the small, close-knit school community we have there. The principal and counselor greet us at the door daily. They know every child's name. It is a warm, inviting and safe place for our students' growing minds.\nMy request would be that you reconsider the proposal to re-build Raleigh Hills as a 750 capacity school. The education specification for this is over a decade old and was drafted pre-covid. The ed-spec MUST be re-evaluated. Please re-build RH at a lower capacity. 750 is not what our students and staff need. The small school community is not just for students - it's for parents and caregivers and everyone in the neighborhood. Please look at what is best for students and staff, not strictly the budget.\n"}, {"id": "2024-05-28_Dawn_Prochovnic", "date": "2024-05-28", "first_name": "Dawn", "last_name": "Prochovnic", "association_with_bsd": "Other Community Member", "sentiment": "Negative", "topics": ["school rebuild", "school closures", "mega schools", "community schools", "traffic concerns", "bond transparency"], "comment": "I'm deeply concerned about plans to rebuild Raleigh Hills School for 750+ students and the associated potential to close other neighborhood elementary schools to fill one too-big school.\nThere are many issues of concern regarding rebuilding RHS, once a quaint K-8, into a mega school for 750+ children pulled from multiple neighborhoods, including: traffic congestion/safety, impacts on student learning, the potential for inequitable access to safe routes to walk and roll to school, and rupturing communities that are centered around their neighborhood school.\nThe District depends on community support to pass levies and bonds, support I've been proud to provide in the past. I'm embarrassed that I advocated for a Bond that was sold to voters under misleading and/or false pretense.\nI urge you to PAUSE plans to rebuild RHS as a 750+ student mega school, listen to and engage with the community that supported the Bond that is paying for this project, and address our concerns.\n"}, {"id": "2024-05-28_Kendra_Douglas", "date": "2024-05-28", "first_name": "Kendra", "last_name": "Douglas", "association_with_bsd": "Parent/Guardian", "sentiment": "Negative", "topics": ["McKay Elementary", "school closures", "community schools", "bond transparency"], "comment": "Mckay Elementary is vital to our kids and our community. The teachers, staff, and principal are kind and caring and know all the students by name. Community schools are what's best for our children, not mega schools with larger class sizes. Closing schools was not in the bond measure. This is a deceptive use of our tax dollars. Raleigh Hills school demo and construction should be paused if the district isn't ready to make a decision about it! Please consider upgrading McKay instead of closing it.\n"}, {"id": "2024-05-28_Meaghan_M", "date": "2024-05-28", "first_name": "Meaghan", "last_name": "M", "association_with_bsd": "Staff Member", "sentiment": "Negative", "topics": ["school consolidation", "school size", "planning", "compensation"], "comment": "I am glad there is a pause on consolidating the elementary schools. I believe more thought needs to be put into these decisions especially ones that impact our youngest learners. Research shows students do better in smaller learning environments. I know that enrollment numbers are declining so why are we focusing on building schools that hold larger amounts of students and taking students out of their neighborhood schools and smaller communities.\nI also want to ask the district to please support our compensation requests in bargaining. With the price of everything increasing and many of us facing student loan payments we had to take to even get this job, it's time for our COLA to be increased to match the world around us.\n"}, {"id": "2024-05-28_Emily_Schubert", "date": "2024-05-28", "first_name": "Emily", "last_name": "Schubert", "association_with_bsd": "Other Community Member", "sentiment": "Negative", "topics": ["school closures", "school size", "community schools", "student growth", "parent involvement"], "comment": "As a former BSD student, I thrived in the smaller community elementary school of McKay. The community outreach that occurred while I was there was crucial for student and parent engagement. Closing schools to make larger ones will not allow for optimal classroom environments to encourage student growth, development, and learning. I also fear that larger schools will actually cause less parent involvement, which is also detrimental to the schools.\n"}, {"id": "2024-05-28_Cherise_Arthur", "date": "2024-05-28", "first_name": "Cherise", "last_name": "Arthur", "association_with_bsd": "Other Community Member", "sentiment": "Negative", "topics": ["district leadership", "student discipline", "insurance changes", "staff concerns", "district policies"], "comment": "In regards to the review of [name] I have some comments and concerns. As an employee who recently retired I noticed a lot of changes in the last 2 years at BSD that have not been good. Because of the changes at district we saw less students being disciplined and causing issues for staff and other students because if you suspend for 10 days that is money the district is loosing. This is effecting staff and other students and we need to go back to how we have always had to deal with student behavior. Also the issue with changes in our insurance is very concerning to staff. We have always been considered a good district but a lot of staff don't feel that way and are frustrated with district policies and the principals hands being tied. Having to have an appointment to get into district office makes it feel very strange when we used to be able to go and talk to district employees. I suggest we find a new admin who cares more about our community than climbing the ladder.\n"}, {"id": "2024-05-28_Jo_Fidler", "date": "2024-05-28", "first_name": "Jo", "last_name": "Fidler", "association_with_bsd": "Staff Member", "sentiment": "Negative", "topics": ["small schools", "community schools", "Raleigh Hills rebuild", "transparency", "communication"], "comment": "We need to preserve our small community schools, specifically in regards of the small schools that will be impacted by the Raleigh Hills rebuild (Montclair, Raleigh Park and Montclair). Small schools are critical in continuing the reach community relationships that they provide. If we continue to build these 700+ occupancy schools we will lose so much in relationship building, support services, and community engagement. As a teacher I know this process will continue to move forward, and I am aware that schools will have to be folded into the new building. But it is essential that it is a full and transparent process. The principals were not openly part of the conversations, it is UNACCEPTABLE to blindside these principals with lack of information. [name], found out that the school was on the potential closed list by a parent NOT by BSD admin. All community members need to be notified openly of the process and they need a voice in the process.\n"}, {"id": "2024-05-28_Jade_Gonzales", "date": "2024-05-28", "first_name": "Jade", "last_name": "Gonzales", "association_with_bsd": "Parent/Guardian", "sentiment": "Negative", "topics": ["community schools", "mega schools", "school closures", "Raleigh Hills rebuild", "transparency", "trust concerns"], "comment": "I represent the Raleigh Park PTO community. Closing supportive community schools and creating mega-schools like the proposed 750-student new Raleigh Hills Elementary will be to the detriment of our students and will have ramifications for decades to come. You need to live BSD's new mission and put student achievements and community at the center of your decisions about school closures.\nWe want to work together to find a new path forward, one built on mutual trust, transparent process, and authentic community engagement. Please read our full letter.\nWe have three requests:\nDecouple the multiple discussions about populating the new Raleigh Hills facility from the need to address infrastructure issues at other eastside schools\nPause the rebuild of Raleigh Hills School immediately; consider alternative plans for east side facilities\nStart an open and interactive dialogue — rebuild our trust in you and discuss the value of small- and medium-sized community elementary schools\nThank you\n"}, {"id": "2024-05-28_Lori_Thom", "date": "2024-05-28", "first_name": "Lori", "last_name": "Thom", "association_with_bsd": "Staff Member", "sentiment": "Negative", "topics": ["McKay Elementary", "community schools", "school closures"], "comment": "Out of 20+ years as a staff member, McKay School has always had the warmest most close knit community of all the schools I worked in. The success of students, both academically and personally is overwhelming. Such a genuine loving school. Closing the school would go against all the district stands for.\n"}, {"id": "2024-05-28_Megan_Stauffer", "date": "2024-05-28", "first_name": "Megan", "last_name": "Stauffer", "association_with_bsd": "Staff Member", "sentiment": "Negative", "topics": ["American Indian education", "staffing concerns", "SB13 implementation", "curriculum", "funding"], "comment": "I am writing to express my concert about the defunding of the position of American Indian/Alaska Native Education TOSA, which has been occupied by [name]. I am one of the teachers that [name] has been organizing to train staff in each building for Senate Bill 13 Tribal History/Shared History curriculum implementation, among many others. My understanding is that there is still a 2 year timeline left in order to even complete the trainings of staff on the Essential Understandings - that is to say, the teacher background. I am baffled at the decision to cut this position, as it leaves teachers without support or facilitation of trainings. Senate Bill 13 is a legal mandate for Oregon. Already, I know that many schools are not fully in compliance - not because of a lack of will, but because of insufficient teacher background. These trainings have been incredibly important. The district must find a way to continue to fund this important position and comply with Oregon state law.\n"}, {"id": "2024-05-28_April_Powers", "date": "2024-05-28", "first_name": "April", "last_name": "Powers", "association_with_bsd": "Parent/Guardian", "sentiment": "Negative", "topics": ["bond transparency", "school size", "community schools", "school closures", "Raleigh Hills rebuild"], "comment": "We recently learned passing the bond to rebuild Raleigh Hills elementary means that the school will be rebuilt at 2-3x the size than it currently serves (750). Once the school is built, other elementaries will be closed in order to fill that capacity. Expansion of RH was never publicly announced as part of the plan. In fact, docs show this tidbit was deliberately hidden because it might affect the passing of the bond. This is completely unacceptable. BSD also never publicly announced the \"Ed Specs\" decision to rebuild all elem schools at a cap of 750. Schools this size are a disservice to students and communities. BSD's motto is \"Belong, Believe, Achieve.\" No one feels like they belong in a school that large. Please pause the Raleigh Hills rebuild and evaluate other avenues - such as closing RH and redrawing boundaries to accommodate those students at nearby schools. This could save over $60 million dollars and retain our smaller community schools where students can feel they belong.\n"}, {"id": "2024-05-28_Aimee_Jones-Suematysu", "date": "2024-05-28", "first_name": "Aimee", "last_name": "Jones-Suematysu", "association_with_bsd": "Staff Member", "sentiment": "Negative", "topics": ["American Indian education", "staffing concerns", "SB13 implementation", "curriculum", "funding"], "comment": "I am writing to express my concern about the defunding of the position of American Indian/Alaska Native Education TOSA, which has been occupied by [name] I am one of the teachers that [name] has been organizing to train staff in each building for Senate Bill 13 Tribal History/Shared History curriculum implementation, among many others. My understanding is that there is still a 2 year timeline left in order to even complete the trainings of staff on the Essential Understandings - that is to say, the teacher background. I am baffled at the decision to cut this position, as it leaves teachers without support or facilitation of trainings. Senate Bill 13 is a legal mandate for Oregon. Even though at my school we have gotten through many of the modules, we are not fully done. These trainings have been incredibly important and cannot be done without guidance from a TOSA. The district must find a way to continue to fund this important position and comply with Oregon state law.\n"}, {"id": "2024-05-28_Michael_Tanner", "date": "2024-05-28", "first_name": "Michael", "last_name": "Tanner", "association_with_bsd": "Staff Member", "sentiment": "Negative", "topics": ["bond transparency", "small schools", "community schools", "school closures", "student engagement"], "comment": "I have always voted in favor of education, students, and educators, and will continue to do so. However, my trust in the process of approving bonds has taken a hit following the 2022 bond. In hindsight, with current decommissioning discussions, I feel misled and voted in bad faith as there was no mention of decommissioning schools. Small schools provide rich community involvement and engagement, which leads to better connections between students and teachers, and teachers and parents/caregivers. Better connections lead to better academic engagement. In a district that values equity it is not too late to follow our values, even if that means breaking contracts. The district can save tens of millions of dollars by changing course and maintaining our valuable small schools.\n\"Education is the kindling of a flame, not the filling of a vessel.\" Socrates\nLet our small schools burn bright with the flames of engagement, connection, and heart.\n"}, {"id": "2024-05-28_Stephanie_Palmer", "date": "2024-05-28", "first_name": "Stephanie", "last_name": "Palmer", "association_with_bsd": "Parent/Guardian", "sentiment": "Negative", "topics": ["Raleigh Hills rebuild", "school capacity", "bond transparency", "McKay Elementary", "community schools"], "comment": "I am writing to encourage the board to immediately bring themselves up to speed on the Raleigh Hills rebuild situation and to consider building a smaller capacity school. The 2013 Ed Specs are woefully out of date (they don't even follow the current staffing formula for muisc/pe!!) and reflect a time of growth in enrollment. The district was NOT upfront about its plans to consolidate other schools when asking taxpayers to vote for the bond to rebuild Raleigh Hills. As a parent and an educator, I believe in the power of smaller, community focused schools and that they are best for all students. As a parent, I have seen my kids thrive at McKay, where every staff member knows them and is able to go above and beyond to serve their needs, socially, emotionally, and academically. As an educator, I can say there are more kids that fall through the cracks at large schools. This is an urgent matter, but it's not too late to take action to adapt the plans to better suit the community's needs.\n"}, {"id": "2024-05-28_Debbie_Plawner", "date": "2024-05-28", "first_name": "Debbie", "last_name": "Plawner", "association_with_bsd": "Parent/Guardian", "sentiment": "Negative", "topics": ["school closures", "community engagement", "mega schools", "academic performance", "traffic concerns"], "comment": "As per my Change.org petition, 240 residents join me today in demanding BSD halt construction plans and engage our community in any discussion on school closures.\nMega-schools hurt academic performance. When school sizes exceed 500 students, academic, attitude, and behavioral problems increase. This disproportionately impacts students from lower-income families and those of racial and ethnic minorities by being transferred from their neighborhood schools to larger schools outside their neighborhoods (Blatchford, 2003; Hattie, 2006).\nDangerous Impact on Local Traffic. The expanded Raleigh Hills would increase traffic on Scholls Ferry Road and at the already hazardous \"Six Corners\" intersection, worsening backups and congestion.\nLosing neighborhood schools would break down the fabric of vibrant local communities. Poorly planned decisions can lead to decay, as seen with [name], and erode taxpayer trust in future investments in the Beaverton School District.\n"}, {"id": "2024-05-28_Katie_Atkins", "date": "2024-05-28", "first_name": "Katie", "last_name": "Atkins", "association_with_bsd": "Parent/Guardian", "sentiment": "Negative", "topics": ["Raleigh Hills rebuild", "school closures", "community schools", "planning", "Montclair Elementary"], "comment": "Members of the board, thank you for your service.\nI'm writing to ask that you pause the rebuild of Raleigh Hills School immediately in light of the potential domino effect of closing multiple vibrant community schools on the district's east side. Before construction begins, please reconsider what plans are best for Raleigh Hills in conjunction with other facilities' needs. In light of declining enrollment and low capacity in these schools, does it make sense to build a school more than double the current capacity, solely because the Ed Specs, which were written when enrollment was on the rise), suggest it?\nPlease know that closing Montclair ES and the other schools under consideration would be a significant loss for these neighborhoods. Yes, the subject of closing schools can be emotional, but I appeal not to your emotions but instead ask that the board review the facts and BSD's commitments to seek input from the community on this matter.\nThank you,\nKatie Atkins\n"}, {"id": "2024-05-28_Stacey_McKinney", "date": "2024-05-28", "first_name": "Stacey", "last_name": "McKinney", "association_with_bsd": "Parent/Guardian", "sentiment": "Negative", "topics": ["Raleigh Hills rebuild", "fiscal concerns", "school size", "bond measure", "educational outcomes"], "comment": "As a concerned parent, former PTO president, and taxpayer, I urge you to reevaluate the substantial expenditures on the Raleigh Hills rebuild project. Given the global decline in birth rates and the associated long-term demographic shifts, the necessity of such a large-scale project is questionable.\nI propose a fiscally prudent alternative: prioritize improving existing schools with targeted investments in seismic upgrades, HVAC systems, and classroom expansions as outlined in the original bond measure. This approach aligns with the bond's promise--the promise that I voted for--to enhance learning environments across the district without the financial strain of building a mega school.\nMaintaining multiple smaller schools ensures better educational outcomes through smaller class sizes and strengthens community ties, which larger schools might undermine. Let's focus on optimizing our current resources to benefit all students and safeguard the district's financial health.\n"}, {"id": "2024-05-28_Christina_Cabrera", "date": "2024-05-28", "first_name": "Christina", "last_name": "Cabrera", "association_with_bsd": "Parent/Guardian", "sentiment": "Negative", "topics": ["McKay Elementary", "school closures", "community schools", "student relationships"], "comment": "Dear Beaverton school district,\nI'm writing you this letter today with a heavy heart, knowing there is a possibility of closing McKay Elementary School. I have three daughters, two that are attending McKay Elementary school as we speak, they are in 3rd and 4th grade. My oldest daughter has already graduated from college and she also attended McKay.\nOur family has been so lucky to be a part of McKay for all these years. There are so many benefits to a smaller school, it brings families, and teachers together to build relationships and build a great support system for our youth. Keeping these schools around helps keep our young generation connected and not just a student ID#.\nI truly believe that without McKay, all of my girls would have not had the opportunity to have such a great Headstart. The teachers and staff members are the best! They care about each & every student.\nI beg you not to shut these schools down. It's not just a school, it's our community.\nSincerely,\n"}, {"id": "2024-05-28_Molly_Sax", "date": "2024-05-28", "first_name": "Molly", "last_name": "Sax", "association_with_bsd": "Parent/Guardian", "sentiment": "Negative", "topics": ["school closures", "Raleigh Hills rebuild", "community schools", "bond transparency", "research"], "comment": "I appreciate BSD pausing the discussion of school closures and welcome the community approach described in the email on May 22nd, but as a BSD alumni, parent, and local voter, I am asking the district to also pause the planned construction at Raleigh Hills Elementary. Rebuilding that school to be filled with 750 students in fewer grades than it held when we voted for the bond is unacceptable. While my children and I had positive experiences in a neighborhood BSD elementary schools (decades apart!), I am aware that anecdotes do not amount to evidence. And so I ask the district to share with us the data and research behind the EDSPEC move to XL elementary schools. How will these large schools benefit the students and the community? Who learns most successfully in these very large schools? How is community built and sustained in mega schools so each student understands \"they belong\"? BSD must rebuild our trust if they want the community to vote for future funding bonds.\n"}, {"id": "2024-05-28_Stephanie_Silver", "date": "2024-05-28", "first_name": "Stephanie", "last_name": "Silver", "association_with_bsd": "Parent/Guardian", "sentiment": "Negative", "topics": ["Raleigh Hills rebuild", "community schools", "school capacity", "Raleigh Park Elementary", "bond funds"], "comment": "I request the School Board to immediately pause construction at Raleigh Hills and right-size the project to smaller than 750. From there, conduct the community process of determining the best possible set of decisions for this area. While other schools have been built to the current edspec of 750,they did so in a different set of circumstances and did not involve closure.\nRaleigh Park is a Title school where all students can thrive, representing the best of what the Beaverton School District can be and upholding the mission to \"belong, believe and achieve\". To threaten its closure is to diminish BSD as a whole. Bond dollars were allocated to important maintenance for this building + should be used to this end.\nPage 77 of Long Range Planning Document articulates an approach (\"Approach B\") around rebuilding facilities at smaller sizes to support the community schools. This is a reasonable path forward that will center our students' success more effectively than a 750-student facility.\n"}, {"id": "2024-05-28_Dawn_Singer", "date": "2024-05-28", "first_name": "Dawn", "last_name": "Singer", "association_with_bsd": "Parent/Guardian", "sentiment": "Negative", "topics": ["planning", "community engagement", "student needs", "district decisions"], "comment": "Before proceeding further, despite the hiatus on meetings and conversations of the Facilities Planning Committee, I implore you to engage in a thoughtful dialogue with all stakeholders involved, including students, parents, teachers, and community members, the ones who will truly be affected by this decision. Let us not rush into decisions that could irreversibly alter the educational landscape of our neighborhoods and district without fully understanding the implications, and recall first and foremost that our students and staff are more than just mere constituents of district profit margins, and that district savings is not the most important facet of this decision.\n"}, {"id": "2024-06-18_Jenny_Ampersand", "date": "2024-06-18", "first_name": "Jenny", "last_name": "Ampersand", "association_with_bsd": "Other Community Member", "sentiment": "Negative", "topics": ["school safety", "youth service officers", "mental health support", "funding allocation"], "comment": "Dear School Board Members,\nI am writing to you with a sense of urgency regarding the allocation of $750,000 in funding for Youth Service Officers-formerly school resource officers (SROs) in our schools. It has become increasingly evident that the presence of SROs does not align with the needs of our students and may even contribute to feelings of insecurity and unease among them.\nI implore the school board to reconsider the allocation of funds currently designated for YSOs and redirect them toward mental health support services.\nInvesting in mental health resources will allow us to address the root causes of student distress and foster a safer, more nurturing learning environment for all.\nI urge you to take immediate action by redirecting all funding from this program. Our students cannot afford to wait any longer for the support they desperately need.\n"}, {"id": "2024-06-18_Katie_Atkins", "date": "2024-06-18", "first_name": "Katie", "last_name": "Atkins", "association_with_bsd": "Parent/Guardian", "sentiment": "Neutral", "topics": ["school closures", "facilities planning", "community engagement", "financial decisions"], "comment": "Greetings, members of the board. Thank you for taking the time to learn about the Facilities Planning Committee and the community conversation around potential closure of BSD schools. As you know by now, many in the BSD community are concerned about the potential closure of our schools. Of course, none of us wants our particular school to close, but the conversation is about much more than any one school. I know there are likely to be difficult financial decisions the board has to make in the near future in light of the state of education funding broadly. But I urge the board to take a holistic view of the situation. It is imperative that the board consider not only the money that may be saved by closing school facilities but the larger negative impacts that may result. Please consider student belonging and achievement, and the voices of the communities you have pledged to represent, and not only the near-term financial impact, when you decide how to proceed.\n"}, {"id": "2024-06-18_Keri_Bernstein", "date": "2024-06-18", "first_name": "Keri", "last_name": "Bernstein", "association_with_bsd": "Parent/Guardian", "sentiment": "Negative", "topics": ["school rebuild", "Raleigh Hills Elementary", "community engagement", "educational specifications", "planning"], "comment": "I ask again that you pause the demolition and rebuild of Raleigh Hills until you have completed your \"extensive community engagement about the future of Beaverton schools in the fall\". It is irresponsible (both operationally and fiscally) to move forward with a rebuild BEFORE a new plan is in place. Once the new proposals have been examined and a new plan is in place, THEN you can move forward with the plan. I do hope that this process also includes examination of the EdSpecs especially in regards to the Elementary School size, as your current specification is not based on any research or data and in practice at other schools is proving to be too big. Younger children need a smaller community to foster development and thrive. I do not want my neighborhood school to close, but I am not naive to the fact that neighborhood schools may need to close. I simply ask that it be a solution to a problem not a solution in search of a problem.\n"}, {"id": "2024-06-18_Sandy_Chung", "date": "2024-06-18", "first_name": "Sandy", "last_name": "Chung", "association_with_bsd": "Parent/Guardian", "sentiment": "Negative", "topics": ["police in schools", "student safety", "school-to-prison pipeline", "equity concerns", "mental health services"], "comment": "I submit this as the Executive Director of the ACLU of Oregon & a BSD parent.\nPolice do not belong in schools:\nReason 1 - The ACLU of Oregon has received multiple credible reports about police in Oregon schools harming students via the following types of misconduct: physical assaults; sexual harassment; and bullying & intimidating students of color, students with disabilities & students from immigrant families.\nReason 2 - Data indicates that police in schools are not effective at preventing or stopping shootings & gun-related incidents.\nReason 3 - Police do not have a legal responsibility to protect students.\nReason 4 - Police criminalize youth behavior & contribute to the school-to-prison pipeline.\nReason 5 - Police disproportionately harm students of color & students with disabilities\nFor more info, please see: \"Cops and No Counselors: How the Lack of School Mental Health Staff is Harming Students,\" at https://bit.ly/aclu-school-cops.\nPlease vote NO to police in BSD schools.\n"}, {"id": "2024-06-18_Jocelyn_Daunheimer", "date": "2024-06-18", "first_name": "Jocelyn", "last_name": "Daunheimer", "association_with_bsd": "Staff Member", "sentiment": "Negative", "topics": ["school closures", "student achievement", "community schools", "equity concerns", "teacher retention"], "comment": "I am writing as both a parent and a BSD employee to express my deep concern over the district's plans to potentially close multiple neighborhood schools. The proposed plan is in direct conflict with the district's stated values of student belonging, equity and academic achievement. A plethora of research indicates that small schools lead to improved outcomes for kids, including increased attendance, teacher retention, community involvement, academic achievement, and equity for students who need the most support.\nAs a district employee (SLP) at a \"mega school\" of over 800 students, I can testify firsthand about the challenges of creating a sense of community, inclusion, and cohesion at a school so large.\nI hope that the district will make student success it's highest priority in the next round of decision making. I fear that you will lose the trust of many community members (and the support for future bond measures) if you do not.\n"}, {"id": "2024-06-18_Kim_deSully", "date": "2024-06-18", "first_name": "Kim", "last_name": "deSully", "association_with_bsd": "Staff Member", "sentiment": "Neutral", "topics": ["teacher training", "substitute teachers", "staff planning time", "scheduling"], "comment": "I don't know if it is possible but can you add a few days on to a teachers work year and use this time to train on new curriculum or other items. I notice teachers are out a lot for district things and they need to bring in subs. I would think teachers would be happy making more money and district wouldn't have to pay for all the subs and not worry about coverage on those days.\n"}, {"id": "2024-06-18_Claire_Douglass", "date": "2024-06-18", "first_name": "Claire", "last_name": "Douglass", "association_with_bsd": "Staff Member", "sentiment": "Negative", "topics": ["school consolidation", "communication concerns", "transparency", "community engagement"], "comment": "I'm writing in regards to the possible plans of consolidating schools. As a teacher at McKay I am very concerned that this is not in the best interest for our students, families and communities. While I understand decisions need to be made I urge the school board to set high expectations for the district when it comes to authentic communication and discourse. I am concerned that telling families that there will be listening sessions and discussions is just postponing the inevitable with decisions already made. Please urge honesty and transparency in all communications. I was incredibly saddened when watching the bond advisory committee meeting to see one member speak up in reference to all of the public written comments in regards to adhering to bond language just to be essentially shut down by district staff. This felt like a way for community to make their voices heard in terms of future bonds, trust and the passing of them but once again the district shut down discourse.\n"}, {"id": "2024-06-18_Jade_Gonzales", "date": "2024-06-18", "first_name": "Jade", "last_name": "Gonzales", "association_with_bsd": "Parent/Guardian", "sentiment": "Neutral", "topics": ["school priorities", "student achievement", "community engagement", "Raleigh Park Elementary", "transparent process"], "comment": "I am Jade Gonzales, the PTO President at Raleigh Park Elementary School, a Title 1 School. We appreciate the district's pause on this issue that will change the Beaverton Education landscape for generations.\nWe have 3 requests and will email more details:\n1. Kids should be at the center of every major decision, and Elementary Schools, the most impactful part of education, MUST be prioritized.\n2. We request the opportunity to present to the school board + have individual conversations with each of you.\n3. A transparent public process must include public input BEFORE any proposal is developed.\nWe want to work with the district. We know that we have shared values, but placing what is best for kids at the center of the conversation is non-negotiable. Our community is very activated, and we have worked hard to stay productive. This decision requires a transparent process, including community input and representation from affected communities as a part of the proposal stage development.\n"}, {"id": "2024-06-18_Diane_Hall", "date": "2024-06-18", "first_name": "Diane", "last_name": "Hall", "association_with_bsd": "Staff Member", "sentiment": "Negative", "topics": ["school size", "academic achievement", "student success", "Raleigh Hills rebuild", "community schools"], "comment": "Research reviews suggest a maximum of 300-400 students for elementary schools is most beneficial to students. In general, studies focused on the social and emotional aspects of success conclude that no school should be larger than 500, while those looking primarily at test scores say that somewhat larger is still effective, especially for more affluent students. Perhaps most notably, researchers focusing on the interaction between poverty and enrollment size offer a rule of thumb: The poorer the school, the smaller its size should be (Howley, C., & Bickel, R. (2000). Additionally, research indicates that students in smaller schools often have higher rates of academic achievement, including higher test scores, increased rates of homework completion, and more positive academic outcomes overall (Cotton, 1996; Leithwood & Jantzi, 2009). I implore you to reconsider the size of the Raleigh Hills rebuild and keep our small neighborhood schools open where we can best instruct students.\n"}, {"id": "2024-06-18_Jennifer_Hoffman", "date": "2024-06-18", "first_name": "Jennifer", "last_name": "Hoffman", "association_with_bsd": "Staff Member", "sentiment": "Negative", "topics": ["union bargaining", "teacher contracts", "staff compensation", "insurance benefits"], "comment": "I'm concerned about how the district's bargaining team is handling bargaining with BEA.\nThe district's bargaining team has not been coming to the table in a manner that is respectful and beneficial. After over 2 months of having multiple articles, the district finally returned to the table with them, but with essentially no change, and then was mad that BEA was using caucus time to get work done. I was in the room, and it was very discouraging and confusing.\nOur insurance premiums are going up (after the district also handled that with great disregard to how it affects their employees) and we will have no compensation to make up for the new costs.\n"}, {"id": "2024-06-18_Lauren_Kelly", "date": "2024-06-18", "first_name": "Lauren", "last_name": "Kelly", "association_with_bsd": "Parent/Guardian", "sentiment": "Negative", "topics": ["school closures", "community schools", "McKay Elementary", "Raleigh Hills rebuild", "community connections"], "comment": "Greetings school board members and Superintendent Balderas,\nI am a proud parent of 2 children at McKay Elementary. No doubt you receiving many comments regarding the potential school closures. I sincerely appreciate the district pausing the immediate plans to recommend school closures and promising to have a community discussion regarding best steps forward.\nI urge you to think outside the box and think how we can keep our community schools open even with the new Raleigh Hills rebuild. Closing schools and shuttling students to the new school might be the easy and quickest choice, but PLEASE consider the impact this will have on students, teachers, staff, parents and families. I love my neighborhood and my daily walk to school with my children. It might seem like a small thing, but small things matter greatly. In our post-pandemic world, I cherish this community we have created. All small school communities would say the same.\nPlease keep our schools open!\n"}, {"id": "2024-06-18_Stacey_McKinney", "date": "2024-06-18", "first_name": "Stacey", "last_name": "McKinney", "association_with_bsd": "Parent/Guardian", "sentiment": "Negative", "topics": ["Montclair Elementary", "school closures", "community schools", "mega schools", "student experience"], "comment": "As a concerned parent, former PTO president of Montclair Elementary, and taxpayer, I strongly oppose the proposed closure of Montclair Elementary School. My two children have benefited from the personalized attention and community atmosphere at Montclair. The staff's familiarity with each student has created a supportive environment for each child.\nCommunity schools help prevent students from feeling lost, ensuring they receive the attention they need to thrive.\nClosing Montclair would disrupt current students' education and risk diminishing the close-knit community essential for their success. This \"megafactory\" blueprint contradicts the district's commitment to student well-being and academic outcomes.\nPlease prioritize improving existing schools with targeted investments in seismic upgrades, HVAC systems, and classroom expansions as outlined in the original bond measure. Deliver on the promise to enhance learning environments and communities across the district.\n"}, {"id": "2024-06-18_Sarah_Parr", "date": "2024-06-18", "first_name": "Sarah", "last_name": "Parr", "association_with_bsd": "Staff Member", "sentiment": "Negative", "topics": ["communication concerns", "transparency", "facilities planning", "school consolidation", "community engagement"], "comment": "I began to lose faith last month when I saw the chalk erased from the parking lot before the previous meeting even ended. Was this what BSD thought was a proper use of its resources? That faith continues to wavier after receiving the \"Next Step\" email AFTER staff when home as it seems the district doesn't want to leave time to let us get organized. Opening the conversation around enrollment is fantastic but continuing to build a school of that size and not consolidate seems like a facade.\nTaxpayers expected their money to go to protecting and repairing their community schools, not supplying them with new furniture just to get shut down. The \"extensive community engagement about the future\", seems theatrical when the scale of the mega school will continue to break ground without edits. How have voter misinformation, Scholls' traffic concerns, equitable involvement of families with different needs, and mass bussing-in students changed within the board since being brought up in May?\n"}, {"id": "2024-06-18_Tyler_Parr", "date": "2024-06-18", "first_name": "Tyler", "last_name": "Parr", "association_with_bsd": "Other Community Member", "sentiment": "Negative", "topics": ["school consolidation", "community schools", "bond transparency", "school closures", "communication concerns"], "comment": "Taxpayers expected their money to support/repair community schools, not to have them consolidated. The so-called \"extensive community engagement\"feels like a show when the mega school project continues unaltered. What changes have been made regarding voter misinformation, traffic concerns, equitable involvement of families with diverse needs, and the mass busing of students since these issues were raised in May? The only thing I've been able to see is how the board/district washed out the voices as they did to the children's chalk drawing the day of the May meeting. The \"communication\" award given to the district was just as laughable. My wife started with the district at a larger school, it has been such a joy seeing her come home and not dread the next day now that she's at a community school. One that closes in every 8 of those scenarios. When the board said \"enrollment size\", did they also mean redrawing borders? And in any choice, do schools stay open? Reopen as k-8 like promised\n"}, {"id": "2024-06-18_Debbie_Plawner", "date": "2024-06-18", "first_name": "Debbie", "last_name": "Plawner", "association_with_bsd": "Parent/Guardian", "sentiment": "Negative", "topics": ["school closures", "Raleigh Hills rebuild", "community engagement", "traffic concerns", "academic performance"], "comment": "We the 450undersigned express our concerns about Raleigh Hills Elementary's rebuilding plans and potential closures of McKay, Montclair, Raleigh Park, and Greenway schools. We demand transparency and community involvement before decisions are made.\nBuilding Raleigh Hills to a 750-student capacity harms academic performance, as larger schools decrease personalized instruction and lower achievement. BSD must disclose the planned enrollment capacity and justify this decision.\nIncreasing Raleigh Hills' capacity will worsen traffic at the hazardous \"Six Corners\"intersection. BSD must re-evaluate its traffic impact study to ensure safety.\nSchool closures disrupt equitable, walkable communities and disproportionately affect low-income and minority students. BSD must involve the community in discussions to avoid inequities and maintain trust.\nWe demand BSD steward resources transparently and show how proposed changes benefit our children and communities.\nSee: https://tinyurl.com/SOStoBalderas\n"}, {"id": "2024-06-18_Jessi_Presley-Grusin", "date": "2024-06-18", "first_name": "Jessi", "last_name": "Presley-Grusin", "association_with_bsd": "Other Community Member", "sentiment": "Negative", "topics": ["police in schools", "student safety", "equity concerns", "marginalized students"], "comment": "I live in the Portland area and am very concerned by the proposal to place police officers on public school campuses. Placing police on school campuses does not make students or staff safer. Black, brown, low-income, queer and trans, and disabled students deserve much better than to be put in harms way like this. There is also ample evidence that bringing police into public schools negatively impacts attendance and grades. Please do not bring police into public schools.\n"}, {"id": "2024-06-18_Lori_Russell", "date": "2024-06-18", "first_name": "Lori", "last_name": "Russell", "association_with_bsd": "Parent/Guardian", "sentiment": "Negative", "topics": ["Raleigh Park Elementary", "school closures", "Title 1 schools", "community schools", "infrastructure investment"], "comment": "I am a proud parent of students at Raleigh Park Elementary School. The possible school closure announcement has the entire community shook. As a Title 1 school, our students are far too overlooked to benefit from being in a larger group. Many of the parents are too busy providing for the daily needs of their families to advocate for their children at school. They TRUST the district to do what is best. Doing what is best is not closing Raleigh Park Elementary. Connected to a beloved library and enormous park, the school campus alone is too valuable for the district to lose, let alone the community. It's worth allocating some of the funding from the rebuild bond into fixing the seismic problem at Raleigh Park and possibly expanding it to accommodate for a small but reasonable amount of additional students. Our state schools are failing and need the kind of collaborative, community learning that goes on at our school. I urge you to keep this in mind for the future.\n"}, {"id": "2024-06-18_Chloe_Sain Thomason", "date": "2024-06-18", "first_name": "Chloe", "last_name": "Sain Thomason", "association_with_bsd": "Staff Member", "sentiment": "Negative", "topics": ["mental health services", "public safety officers", "student support", "funding allocation"], "comment": "There is a great deal of funding being allocated to public safety officers having a presence in Beaverton schools. As a school counselor in the Beaverton school district, I have seen first hand the impact public safety's presence has on students. Students are afraid, concerned and feel unsafe in the presence of SROs/police officers. As one of the only mental health professionals in my building, I see a huge and dire need for more mental health professionals in our schools. Students are processing traumas that our generation may never understand. Our students need help and mental health support, not more armed/uniformed officers. Please consider the need for other professionals within our schools before committing to funding public safety. We have an opportunity to support our students in overcoming their unique obstacles, funding mental health professionals will help us achieve that goal. Please utilize our valuable funds in a direction that is student-focused.\n"}, {"id": "2024-08-13_Jeff_P", "date": "2024-08-13", "first_name": "Jeff", "last_name": "P", "association_with_bsd": "Staff Member", "sentiment": "Negative", "topics": ["union contract", "staff compensation", "cost of living adjustments", "classified employees"], "comment": "My note is in regard to ongoing BSD/OSEA contract negotiations. At the time of this comment submission, the BSD COLA offer to classified employees is insulting (less than 2%). The bargaining team is trying to position the offer as 3.75%, but that includes market reclassification as well. COLA is an inflation adjustment that impacts ALL classified employees equally. The reclassification adjustments should be bargained separately and with complete transparency.\n"}, {"id": "2024-08-13_Christine_Sinner", "date": "2024-08-13", "first_name": "Christine", "last_name": "Sinner", "association_with_bsd": "Staff Member", "sentiment": "Negative", "topics": ["staff compensation", "insurance benefits", "classified staff", "hiring challenges"], "comment": "Classified staff members need to have a living wage. If our health insurance increases by 10% and our wages increase by 3% we are still down 7%. Many Classified staff take home about $2000 a month. A lot of Classified staff work for the BSD for the great benefits despite the low pay. If that is no longer the case, it will be increasingly difficult to hire good people. I have three open positions at my school and the hiring pool is very shallow. Our students deserve good people to help them. You get what you pay for. Please support our Classified staff by covering the increase in benefits costs.\n"}, {"id": "2024-08-13_Robert_Slater", "date": "2024-08-13", "first_name": "Robert", "last_name": "Slater", "association_with_bsd": "Staff Member", "sentiment": "Negative", "topics": ["cost of living adjustment", "staff compensation", "union contract"], "comment": "Why is the school district only offering a less than 1% COLA? This seems like an intentional insult.\n"}, {"id": "2024-08-13_Jennifer_Knight", "date": "2024-08-13", "first_name": "Jennifer", "last_name": "Knight", "association_with_bsd": "Parent/Guardian", "sentiment": "Negative", "topics": ["cell phone policy", "student technology", "student mental health", "district policy"], "comment": "As a parent of 2 middle schoolers, I request that the Board take urgent action in response to the BEA resolution shared in June to ban cell phones in schools. The district policy \"JFCEB on Personal Electronic Devices and Social Media\" is woefully outdated (from 2015). Since that time, dozens of studies show that smartphones hinder education, increase anxiety/depression, hinder proper socialization, perpetuate inequalities among students, and more negative effects (for an abundance of stats from various sources, visit phonefreeschools.com, or consult \"The Anxious Generation\" by Jonathan Haidt). If BSD is serious about its promise to \"Belong. Believe. Achieve.\" then I feel there is no more cost effective and efficient way towards quickly achieving this than getting smartphones out of the school day. This is not something to ponder for another year (I first submitted these comments over a year ago). Our children are reaping the ill-effects of outdated practices/policies NOW. Thank you.\n"}, {"id": "2024-08-13_Claire_Douglass", "date": "2024-08-13", "first_name": "Claire", "last_name": "Douglass", "association_with_bsd": "Staff Member", "sentiment": "Negative", "topics": ["Raleigh Hills rebuild", "small schools", "school safety", "school design", "McKay Elementary"], "comment": "I am writing in regards to the Raleigh Hills rebuild. As a teacher at McKay the value of a small school can not even be explained. As a teacher I know every student in the school, their families and their stories. Teaching at a large mega school does not appeal to me at all as I love the community and connections within a small school. Also, from a safety standpoint I noticed in the pictures of the new build the district has posted it looked like windows were on classrooms out to the hallway. This would not be a safe design in terms of being out of sight from danger. Hallways are also were students who are not regulated tend to end up and this would cause distraction and chaos. I urge the board to reconsider the size sand safety of the new Raleigh Hills rebuild.\n"}, {"id": "2024-08-13_Nancy_Bolton", "date": "2024-08-13", "first_name": "Nancy", "last_name": "Bolton", "association_with_bsd": "Parent/Guardian", "sentiment": "Negative", "topics": ["Raleigh Hills rebuild", "Montclair Elementary", "community schools", "mega schools", "student experience"], "comment": "Hello, I am writing regarding the ongoing rebuilding of Raleigh Hills and plan for a 700+ school on that site. I had two kids who went through Montclair. Each of them had an unexpectedly good experience. As parents, we both volunteered at the school and felt deeply connected to the school community.\nI understand that the student body at Montclair has been shrinking and that is a problem. However, based on my discussions with other parents whose kids attend mega-schools, the mega-school model is not healthy for kids. It is hard to have a cohesive sense of community in a large school. The communal areas are often loud and overwhelming from a sensory standpoint, including the areas where kids go to have special instruction.\nI understand that a change may need to be made. However, instead of building one new mega-school, I strongly encourage you to make changes to increase the student body in several small successful small schools that we already have in our community.\n"}, {"id": "2024-08-13_Amy_Starke", "date": "2024-08-13", "first_name": "Amy", "last_name": "Starke", "association_with_bsd": "Other Community Member", "sentiment": "Negative", "topics": ["Montclair Elementary", "community schools", "small schools", "student experience"], "comment": "My husband and I have lived in Beaverton for 32 years, and our two now-grown sons attended Beaverton schools (Montclair, Whitford, Beaverton HS and School of Science and Technology). I was a volunteer at Montclair (Art Literacy) and a band mother at Beaverton HS. Montclair is a small elementary school and my children thrived there because of its smallness. We knew most of the teachers' names and the teachers knew most of the children. I don't feel that they lacked anything because of the small school. They had music and P.E. and Art Literacy along with the education fundamentals. A bigger elementary school may have more bells and whistles and extracurriculars, but that can't make up for the anonymity and feeling of being a little fish in a big pond, or a tiny cog in a big machine. I understand that Beaverton School Board has to steward taxpayer dollars wisely and faces tough decisions, but I feel that keeping the smaller schools open is critical for our children's future.\n"}, {"id": "2024-08-13_Alysse_Cruickshank", "date": "2024-08-13", "first_name": "Alysse", "last_name": "Cruickshank", "association_with_bsd": "Parent/Guardian", "sentiment": "Negative", "topics": ["class size", "West TV Elementary", "teacher staffing", "third grade"], "comment": "62 3rd graders is too much for 2 teachers please considering hiring a 3rd teacher at West TV\n"}, {"id": "2024-08-13_Megan_McMillan", "date": "2024-08-13", "first_name": "Megan", "last_name": "McMillan", "association_with_bsd": "Parent/Guardian", "sentiment": "Negative", "topics": ["Raleigh Hills Elementary", "traffic concerns", "school consolidation", "safety", "transportation"], "comment": "I am incredibly concerned about the safety and ability for 800 families to get to a consolidated Raleigh Hills elementary off Scholls Ferry road. As a two lane (only one in each direction) road that is used as a major commuting thoroughfare, there is already a frequent backup of traffic during both the morning and afternoon rush hour on that road between Allen Blvd and Six Corners. Raleigh Hills is not safely walkable because it would require walking through the dangerous Six Corners intersection (for Montclair families) or crossing Beaverton Hillsdale Highway and cutting through a busy parking lot (for Raleigh Park families), so we will all have to drive because many of us will still be unbussed for living <1mi away. What a traffic nightmare--both for parents trying to make an early bell, and for business commuters with no lane to pass around the long line for parent dropoff which is sure to extend into the street in both directions. This is no location for an 800 student school.\n"}, {"id": "2024-08-13_Christine_Seaman", "date": "2024-08-13", "first_name": "Christine", "last_name": "Seaman", "association_with_bsd": "Parent/Guardian", "sentiment": "Negative", "topics": ["class size", "West TV Elementary", "teacher staffing", "third grade", "student engagement"], "comment": "As a parent of two students at West TV, one of which is entering 3rd Grade this fall, I am alarmed at the potential unacceptable class sizes (~31 students) that would result from the proposed two teachers/classes. My daughter loves school and loves learning but she is also not someone who is comfortable speaking up in large groups so I worry that a large class size would diminish her ability to succeed. In addition, the more kids the more distractions and stress is created for both kids and teachers inhibiting their ability to learn. I'm sure you are aware that smaller class sizes have a wealth of benefits to students (and their teachers) and that those benefits at an early age extend through their academic lifetimes. With just a couple weeks left before the school year begins, I strongly suggest that all efforts be made towards adding a 3rd teacher to teach 3rd grade at West TV to allow the students to continue on a good path of learning and enrichment per the district strategy.\n"}, {"id": "2024-08-13_Tiffany_Mathes", "date": "2024-08-13", "first_name": "Tiffany", "last_name": "Mathes", "association_with_bsd": "Parent/Guardian", "sentiment": "Negative", "topics": ["class size", "West TV Elementary", "teacher staffing", "third grade", "student needs"], "comment": "Parents of the third-grade class at West TV Elementary have to fight every year for our students, so here we are again. Our class is uniquely large for the school's size and requires the addition of a third teacher. Our teachers should be able to meet the needs of all students and provide an equitable experience to this grade level without the added burden of managing 10 more students than any other class in the school. We know that smaller class sizes are a crucial piece of realizing the vision expressed in our district's strategic plan. As a teacher, I can personally attest to the importance of small class sizes. I am able get to know my students' needs academically, socially, and emotionally in a way that can feel impossible when stretched to my own professional limits. Please live up to the ideals of our guiding principles and allocate a third teacher for the third-grade class at West TV Elementary now.\n"}, {"id": "2024-08-13_Justin_Mathis", "date": "2024-08-13", "first_name": "Justin", "last_name": "Mathis", "association_with_bsd": "Parent/Guardian", "sentiment": "Negative", "topics": ["class size", "West TV Elementary", "teacher staffing", "third grade"], "comment": "Not sure why we have to do this every single year, but here we are. The upcoming third grade class at West TV is the largest group at the school. It has been every year since they were Kindergartners. Each year we have to plead with the district to add a third teacher, because having an elementary classroom (I would argue any classroom) with more than thirty students in it is detrimental to everyone. Could an additional third grade teacher please be added to our school? Thanks, and I look forward to doing this all again next year!\n"}, {"id": "2024-08-13_Stephanie_Silver", "date": "2024-08-13", "first_name": "Stephanie", "last_name": "Silver", "association_with_bsd": "Parent/Guardian", "sentiment": "Negative", "topics": ["school size", "educational specifications", "Raleigh Hills rebuild", "community schools", "district comparisons"], "comment": "I would like the members of the school board to ask and consider why BSD leads the region with the largest elementary ed spec at 750 students, when comparable districts plan schools that are much smaller. For example, Portland builds to 600, Seattle builds to either 500 or 650, and Salem-Keizer plans for 400-600. Why, in 2024, is Beaverton building schools that are 20-35% larger than nearby districts?\nAs you consider this, please see 2021's Long Range Planning document, page 78, for approaches to building. \"Approach B\" is aligned with community needs, as it seeks to \"retain neighborhood schools without building unnecessary space.\" \"Approach A\", which appears to be the misguided strategy utilized in the Raleigh Hills build currently, will build a mega school that will close several neighborhood schools and gut the surrounding area.\nThese decisions will last for decades. Please, reduce the ed spec from 750 to 500-600. And do not devastate our communities with Approach A.\n"}, {"id": "2024-08-13_Mitzi_Sandman", "date": "2024-08-13", "first_name": "Mitzi", "last_name": "Sandman", "association_with_bsd": "Other Community Member", "sentiment": "Negative", "topics": ["Raleigh Hills rebuild", "communication concerns", "transparency", "community engagement", "construction timeline"], "comment": "I'm dismayed at the lack of communication from BSD regarding the valid community concerns around the Raleigh Hills Elementary expansion. It's been requested several times & in many ways to keep the community better informed and yet, there has been no formal communication since the June 12 update that states \"the construction of Raleigh Hills is moving forward.\" Several of us in the community have pieced together that there may be discussion at the School Board Work Session on Aug 13 on reducing the size of the RH building and changing the scope of the project but it's all conjecture, and we know that time is of the essence as Pence Construction finishes demolition and moves on to construction in early September. Please show respect to the parents, students and broader community by acknowledging the issues brought up repeatedly in Board meetings, public comments, email, Superintendent Chats, social media and so on, that the current plan is not acceptable to the majority of the community\n"}, {"id": "2024-08-13_Mamiko_G", "date": "2024-08-13", "first_name": "Mamiko", "last_name": "G", "association_with_bsd": "Staff Member", "sentiment": "Negative", "topics": ["special education", "staffing concerns", "student safety", "staff safety", "support services"], "comment": "I am a paraeducator in a sped program at an elementary school in BSD. Last school year was very challenging with chronic lack of proper staffing, aggression and violence in the classrooms, staff/student injuries, lack of concrete support from special education department, and lack of meaningful support for parents of students with severe special needs by BSD. Our classrooms were very unsafe due to misplacements and lack of placement options. All sped department seemed to care about was legal student-staff ratio. This tendency was very dangerous as in reality mere numbers/class size could not ensure staff/student safety. Substitute staff to our classrooms were very hard to come by. They fear for their safety. Those that subbed for us were often untrained. They unknowingly fueled student dysregulation and aggression and often became the targets and got hurt. We are about to start a new school year with very similar situations. Please do better to ensure our safety.\n"}, {"id": "2024-08-13_Patrick_Abell", "date": "2024-08-13", "first_name": "Patrick", "last_name": "Abell", "association_with_bsd": "Parent/Guardian", "sentiment": "Neutral", "topics": ["facilities planning", "financial transparency", "school closures", "budget priorities", "community engagement"], "comment": "The community would appreciate more clarity from the school district and school board about the financial goals related to Facilities Planning. Are you seeking to reduce yearly operating costs by a certain amount? To even out the cost per student in the district?\nIf reducing costs is a factor, how are you considering impacts of school closures on other areas of the budget (such as transportation)? As you look to reduce spending, are you considering all budget areas (including the many high-cost, niche middle school programs) as you consider the closure of elementary schools, which are the foundation of the K-12 experience?\nThe community is populated with reasonable people who understand the concepts of limited funding and real-world tradeoffs. Without insight into the key goals, the community can neither fully understand nor effectively partner with the school district in this decision-making process.\n"}, {"id": "2024-08-13_Aleida_Adams", "date": "2024-08-13", "first_name": "Aleida", "last_name": "Adams", "association_with_bsd": "Staff Member", "sentiment": "Negative", "topics": ["union bargaining", "staff compensation", "working conditions", "classified staff", "staff retention"], "comment": "I have observed 3 of the most recent bargaining sessions between BSD and OSEA. I am so proud of my union bargaining team and the hard work they are doing for all classified staff. We need to feel supported and respected. There are far too many of our staff who are forced to work multiple jobs, and worry about whether they can pay their rent or access their medications. The current proposal does not come close to resolving these problems. The district has already encountered issues staffing key support positions such as Para IIs. If the COLA proposal by the district does not increase enough to come close to the skyrocketing cost of living experienced by its employees, staffing issues will continue. I have personally experienced the difficulties in maintaining consistency and stability in routines for elementary students when a support position is filled by a rotating list of substitutes, if at all. The district must do better, our staff and students deserve better.\n"}, {"id": "2024-08-13_Michele_Fideler", "date": "2024-08-13", "first_name": "Michele", "last_name": "Fideler", "association_with_bsd": "Staff Member", "sentiment": "Negative", "topics": ["staff compensation", "employee retention", "working conditions", "cost of living"], "comment": "This is my 30th year in the District and I've always been proud to say I work for BSD. I am lucky to have a spouse who was able to help support our family, but not everyone is that fortunate. I know of many of my co-workers who are struggling to make ends meet, and who are considered homeless so I hope that you will approve more funding to support the reasonable COLA increase that OSEA has proposed. If I were single, I could not survive on my wages even though I work 260 days per year and also work many nights and weekends for the Athletic Department. I've also worked other part time jobs up to an additional 30 hours per week over the years to help support my family. Thank you for your consideration.\n"}, {"id": "2024-08-13_Andrea_Miller", "date": "2024-08-13", "first_name": "Andrea", "last_name": "Miller", "association_with_bsd": "Staff Member", "sentiment": "Positive", "topics": ["staff appreciation", "student support", "working conditions"], "comment": "I have been proud to be a Beaverton School District graduate, and a paraprofessional for nearly 20 years. The people working here are committed employees who give deeplyof themselves in support of these students every day, not because it is a job, but because we all believe in the missoni that is education. Please see us! We are here because what we do every day MATTERS. Thank you for your consideration.\n"}, {"id": "2024-08-13_Dena_Green", "date": "2024-08-13", "first_name": "Dena", "last_name": "Green", "association_with_bsd": "Staff Member", "sentiment": "Negative", "topics": ["staff compensation", "cost of living", "insurance benefits", "classified staff", "bargaining"], "comment": "I am a Paraeducator II and have been since 2007. Working in education has never been particularly lucrative but since the cost of living has risen my salary won't pay the rent anymore. I have been at the top of our pay scale for quite some time so all I can hope for is a respectable cost of living adjustment. I sit at the bargaining table where they tell me they can't offer us more than 3.75% when according to salary.com the cost of living went up 3.9% in Washington County last year alone and according livingwage.mit.edu the minimum living wage is over 59,000. So we are already in a defecit, rising slower than the actual cost of living and now paying even more for insurance that used to be free, right before open enrollment. Many of us can no long afford to stay and do the jobs we have loved for so many years. The rising cost of insurance cost many of us about 10% of our pay, so 3.75% COLA as you can see still comes out to a pay cut. People can't afford to come work here and live\n"}, {"id": "2024-08-13_Dawn_Prochovnic", "date": "2024-08-13", "first_name": "Dawn", "last_name": "Prochovnic", "association_with_bsd": "Other Community Member", "sentiment": "Negative", "topics": ["communication concerns", "Raleigh Hills rebuild", "transparency", "community engagement", "bond measure"], "comment": "To the Beaverton School District Administration and School Board,\nI am writing from my perspective as a longtime BSD volunteer, parent of two BSD graduates, and a persistent and vocal advocate for multiple BSD funding measures. The District's communication and community involvement efforts related to the destruction, rebuild, and student occupancy plans of Raleigh Hills School, coupled with the potential future closure of one or multiple elementary schools has been abysmal. I feel duped and misled by the marketing efforts and materials that promoted the Bond Measure. I'm embarrassed and regretful that I fell for the District's inauthentic communication, and that I advocated so widely and so emphatically for the Bond Measure that funded this project. This isn't the first time I've fallen for the District's misleading communication techniques, but it is the last. Community trust has been severely damaged; it must be rebuilt. Please do better.\n"}, {"id": "2024-08-13_Sarah_Parr", "date": "2024-08-13", "first_name": "Sarah", "last_name": "Parr", "association_with_bsd": "Staff Member", "sentiment": "Negative", "topics": ["educational specifications", "school size", "district comparisons", "Raleigh Hills rebuild", "community schools"], "comment": "Please consider why BSD leads the region with the largest elementary education specifications at 750 students, while larger districts plan significantly smaller schools. Portland builds schools for 600 students, Seattle for either 500 or 650, and Salem-Keizer for 400-600. In 2024, why is Beaverton planning to create schools that are 20-35% larger than those in neighboring districts when voters asked for smaller ones?\nI ask that you refer to the 2021 Long Range Planning document, specifically page 78, which outlines various approaches to school construction. \"Approach B\" aligns with community needs, aiming to \"retain neighborhood schools without building unnecessary space.\" Unfortunately, the current strategy being implemented, similar to \"Approach A\" in the Raleigh Hills build, risks creating a mega-school that could result in the closure of several neighborhood schools, thereby undermining the fabric of our communities.\nPlease return to the promised k-8 build or go smaller.\n"}, {"id": "2024-08-13_Tyler_Parr", "date": "2024-08-13", "first_name": "Tyler", "last_name": "Parr", "association_with_bsd": "Other Community Member", "sentiment": "Negative", "topics": ["Raleigh Hills rebuild", "communication concerns", "transparency", "community engagement"], "comment": "I'm deeply concerned by the lack of communication from the Beaverton School District (BSD) regarding the serious community concerns surrounding the Raleigh Hills Elementary expansion. Despite numerous requests, there has been no formal communication since the June 12 update, which merely stated that \"the construction of Raleigh Hills is moving forward.\" This silence is unacceptable, especially as several community members have had to piece together on their own that a discussion might take place at the School Board Work Session on August 13 regarding a potential reduction in the size of the Raleigh Hills building. But this is only speculation, and with demolition nearly complete and construction set to begin in early September, time is running out.\nIt's critical that BSD address the concerns raised by parents, students, and the broader community—concerns voiced repeatedly in Board meetings, public comments, emails, Superintendent Chats, social media, and more. The current plan, which\n"}, {"id": "2024-08-13_Lilliana_De La Garza", "date": "2024-08-13", "first_name": "Lilliana", "last_name": "De La Garza", "association_with_bsd": "Student", "sentiment": "Negative", "topics": ["Raleigh Hills rebuild", "communication concerns", "student perspective", "school closures", "community schools"], "comment": "I'm really worried about how the Beaverton School District (BSD) isn't listening to our community's concerns about the Raleigh Hills Elementary expansion. We've asked so many times for better communication, but there hasn't been any official update since June 12, when BSD just said, \"the construction of Raleigh Hills is moving forward.\" It's frustrating that we've had to figure out on our own that there might be a discussion at the School Board Work Session on August 13 about making the school smaller. But no one really knows for sure, and with demolition almost done and construction starting in early September, we're running out of time.\nI don't want to be in a mega school, I don't want my school to become a mega school. And I especially don't want other schools to close and damage people's neighborhoods.\n"}, {"id": "2024-08-13_Dawn_Singer", "date": "2024-08-13", "first_name": "Dawn", "last_name": "Singer", "association_with_bsd": "Parent/Guardian", "sentiment": "Negative", "topics": ["Montclair Elementary", "school closures", "community schools", "mega schools", "student experience"], "comment": "I am writing with deep concern about the proposed closure of Montclair Elementary, a small but vital cornerstone of our community. Montclair is not just a school; it's a nurturing environment where every child receives personalized attention, and where parents and educators work together in close partnership.\nIn an era where schools are becoming larger and more impersonal, Montclair stands out as a place where every child is known by name, where teachers can focus on individual strengths and challenges, and where a true sense of belonging is fostered. The relationships built within these walls are profound, creating a supportive network that extends far beyond the classroom.\nTransitioning our children to a 750-student school would mean sacrificing this unique, close-knit environment. The loss of Montclair would not only disrupt our children's education but also weaken the tightly knit fabric of our community that has been carefully cultivated over the years.\nPlease keep Montclair.\n"}, {"id": "2024-08-13_Brandi_Wachs", "date": "2024-08-13", "first_name": "Brandi", "last_name": "Wachs", "association_with_bsd": "Parent/Guardian", "sentiment": "Negative", "topics": ["bond transparency", "school closures", "community schools", "Raleigh Park Elementary", "Raleigh Hills rebuild"], "comment": "\"If you have to conceal what you are doing, it is probably something you shouldn't be doing\" - My Mom's wise words to me as a child.\nThis is what the Bond committee, Board, and District did when marketing for their Facilities Improvements Bond, because if there had been the slightest whisper that small schools potentially will close with the rebuild of RH, then this Bond would not have passed. So, they kept that info. quiet and now the community is furious at this deceit. Should the re-build of RH lead to closures of the critically important smaller schools, there will be generations hurt and irreparable damage done.\nI live near Raleigh Park, my daughters attended Raleigh Park, I ran the Jog-aThon at RP, my brothers attended RP, and my Mom was PTO president at RP. Closing this school would decimate decades of memories for LOTS of families.\nSmaller schools have tremendous benefits that should be obvious to anyone that cares about children. Please choose smaller schools.\n"}, {"id": "2024-09-17_Ginger_Jay", "date": "2024-09-17", "first_name": "Ginger", "last_name": "Jay", "association_with_bsd": "Staff Member", "sentiment": "Negative", "topics": ["working conditions", "HVAC issues", "climate control", "facility concerns"], "comment": "For the record - not ALL of our 53 schools have access to \"climate control\" aka- air conditioning. I have worked in my building for 8 years and my room is consistently 74-80 everyday- even in the winter. None of my windows open- and it's miserable teaching 20 wriggly 5 year olds in those conditions. Because the temp is in the \"acceptable range\" nothing is done. The rest of my building is the same- stale warm air flooding into most rooms- except for the two rooms that are freezing. If you check the union Facebook page- my experience is not unique- this should be addressed!\n"}, {"id": "2024-09-17_Sarah_Hawks", "date": "2024-09-17", "first_name": "Sarah", "last_name": "Hawks", "association_with_bsd": "Parent/Guardian", "sentiment": "Negative", "topics": ["working conditions", "work environment", "quality education", "FLEX staff"], "comment": "It's embarrassing to be both a parent and teacher in this district and know that there are truly appalling, sometimes inhumane work conditions thrust upon our staff and students. If you take care of teachers at FLEX, they will also take care of the students. Quality education demands quality environments for people to do their jobs and support students.\nAlso, we know extreme temperatures in learning environments disrupts any potential for learning or operating in the self actualization zone for education. It's time to do right by all stakeholders.\n"}, {"id": "2024-09-17_Taylor_Morrison", "date": "2024-09-17", "first_name": "Taylor", "last_name": "Morrison", "association_with_bsd": "Staff Member", "sentiment": "Neutral", "topics": ["middle school schedule"], "comment": "How do we address issues with the current middle school schedule?\nThank you.\n"}, {"id": "2024-09-17_Miriam_Hernandez", "date": "2024-09-17", "first_name": "Miriam", "last_name": "Hernandez", "association_with_bsd": "Parent/Guardian", "sentiment": "Negative", "topics": ["school closures", "environmental concerns", "green spaces", "sustainability", "public lands"], "comment": "Closing and selling our publicly-owned school buildings and land can have significant environmental drawbacks. Demolishing schools creates waste and contributes to landfill overflow, while constructing new facilities or developments has a substantial carbon footprint. Maintaining existing buildings allows for sustainable reuse and minimizes environmental impact. Additionally, schools provide valuable green spaces and tree canopy that support local biodiversity and serve as community gardens or recreational areas. Selling these properties will lead to their redevelopment, which would obliterate natural habitats and green space. Preserving our school buildings and grounds aligns with environmental stewardship and supports a more sustainable community. Never sell off our public lands - preserve our schools and everything they bring to Beaverton. Closing, destroying and selling off schools would cause far more damage to neighborhoods than the short-term savings are worth!\n"}, {"id": "2024-09-17_Meaghan_M", "date": "2024-09-17", "first_name": "Meaghan", "last_name": "M", "association_with_bsd": "Staff Member", "sentiment": "Negative", "topics": ["union contract", "teacher compensation", "safe learning environments", "FLEX program", "cost of living"], "comment": "Growing up in BSD, I was always taught that this district was the gold standard of the state, when I decided I wanted to work in schools, BSD was still the gold standard in my mind. I hope BSD can continue to be the gold standard by supporting students by supporting educators. The best way to support educators is by agreeing to a fair contract including compensation and safe learning environments. The cost of living in Beaverton and surrounding areas continues to skyrocket in addition to inflation everywhere. I'm encouraging the district to agree to a fair COLA that matches the reality of our increased living costs. Additionally, I'm hoping our district agrees to safe learning environments. During the heat wave, many of our buildings were without cool air because of HVAC issues. Speaking of unsafe, the buildings our FLEX staff are forced to work from. Staff can't teach with multiple people all teaching from the same room and students can't learn. Even the FLEX video felt overwhelming.\n"}, {"id": "2024-09-17_Cassie_Misegades", "date": "2024-09-17", "first_name": "Cassie", "last_name": "Misegades", "association_with_bsd": "Other Community Member", "sentiment": "Negative", "topics": ["union contract", "teacher compensation", "safe learning environments", "social workers", "small schools"], "comment": "As a community member with the intention of raising a family in the Beaverton School District, I want the district to agree to a fair contract with the union. A fair contract includes matching what the union considers a fair cost of living adjustment to match inflation and cost of living increases in the area and providing safe learning environments for staff and students. Agreeing to the union's cost of living improvement helps us keep high quality educators and attract more to teach our students. In the best interest of students, I also want to emphasize the importance of social workers in school buildings. Social workers work hard to create a safe space for all students to share their feelings, developing vital relationships, and providing several community resources for families. Additionally, students thrive in small neighborhood schools because it builds community and staff are able to provide more individualized and one on one support compared to large 800+ student schools.\n"}, {"id": "2024-09-17_Laurel_Hiestand", "date": "2024-09-17", "first_name": "Laurel", "last_name": "Hiestand", "association_with_bsd": "Other Community Member", "sentiment": "Negative", "topics": ["teacher compensation", "class size", "social workers", "small schools", "cost of living"], "comment": "As a future parent in the Beaverton School District, I urge the district to agree on a fair contract with the union. Educators deserve a cost-of-living adjustment that reflects inflation and rising living costs, ensuring they can live in the communities they serve. Fair compensation will help retain and attract high-quality teachers for our children. \nWe must also prioritize safe learning environments and maintain reasonable class sizes. Social workers are essential, providing vital emotional support and connecting families to community resources. Their presence helps students, especially those facing trauma, to thrive.\nSmall, neighborhood schools foster strong community bonds and allow for personalized attention. Expanding elementary schools to 800 or more students risks diluting that sense of community, overwhelming teachers, and leaving students feeling overlooked. We need to preserve these smaller, supportive environments to give every child the best chance to succeed.\n"}, {"id": "2024-09-17_Wasuki_Senthil Kumar", "date": "2024-09-17", "first_name": "Wasuki", "last_name": "Senthil Kumar", "association_with_bsd": "Parent/Guardian", "sentiment": "Positive", "topics": ["student achievement", "entrepreneurship", "student recognition", "Youth-preneurs"], "comment": "I would like to take a moment to honor and recognize Ishana Senthil, a remarkable student in our district, for her outstanding contributions to youth entrepreneurship and education. Ishana's initiative, Youth-preneurs, has empowered over 200 students of color in the Beaverton area, providing them with opportunities to develop their business skills and confidence through engaging workshops and pitch competitions. Her program has been instrumental in fostering a spirit of innovation among young students, preparing them to become future leaders in our community.\nRecently, Ishana's work with her organization Youth-preneurs was featured in the Portland Tribune, a testament to the positive impact she has had not only within our district but also in the wider Portland community. Her vision for accessible education and youth empowerment has been widely acknowledged and celebrated.\nI encourage the board to formally recognize Ishana Senthil's dedication\n"}, {"id": "2024-10-08_Laurie_Umiger", "date": "2024-10-08", "first_name": "Laurie", "last_name": "Umiger", "association_with_bsd": "Parent/Guardian", "sentiment": "Negative", "topics": ["district communication", "teacher contract", "transparency", "community relations"], "comment": "As a parent and community member, the notice sent to the community reads more like propaganda making an effort to vilify certified staff then any sort of transparent communication with the community. The messaging is very disingenuous and I question why our district resources are being spent on this sort of divisive communication as opposed to true support of our staff and students.\n"}, {"id": "2024-10-08_Amy_Wang", "date": "2024-10-08", "first_name": "Amy", "last_name": "Wang", "association_with_bsd": "Parent/Guardian", "sentiment": "Negative", "topics": ["teacher contract", "teacher negotiations", "class size", "school funding"], "comment": "Prevent a teacher strike! Please conclude the negotiation with the teachers. I have reviewed the packets that were sent out and it is a reasonable ask! Also it does not mention that teachers want a smaller class sizes and more teachers! Can you make that happen? Or do you all really want a teacher strike so our children will go 3 weeks without education AND IMPACTING each school's ability to fundraise?\nPlease strongly consider\n"}, {"id": "2024-10-08_Katie_Newcomb", "date": "2024-10-08", "first_name": "Katie", "last_name": "Newcomb", "association_with_bsd": "Parent/Guardian", "sentiment": "Negative", "topics": ["district communication", "teacher contract", "union negotiations", "transparency"], "comment": "I am highly disappointed the district used parent square to send out a misleading email misrepresenting what is happening with the negotiations between BEA and BSD. It was a gross use of power and shows me exactly who and who is not negotiating in good faith. Do better BSD. In solidarity with BEA, Katie Newcomb, parent of three BSD students\n"}, {"id": "2024-10-08_Andrea_Gawlista", "date": "2024-10-08", "first_name": "Andrea", "last_name": "Gawlista", "association_with_bsd": "Parent/Guardian", "sentiment": "Negative", "topics": ["class size", "teacher contract", "student needs", "union negotiations"], "comment": "I am really unhappy with the way the district is handling contract negotiations with the teachers union. There are several items that I don't like, but the most relevant to me is that you will not agree to a class size limit/decreased class sizes. This need is obvious to parents, teachers, and kids. If you are not in support of reasonable class sizes then you are certainly not putting the best interests of the students first.\n"}, {"id": "2024-10-08_Shelly_Zekmeister", "date": "2024-10-08", "first_name": "Shelly", "last_name": "Zekmeister", "association_with_bsd": "Parent/Guardian", "sentiment": "Negative", "topics": ["district communication", "union negotiations", "transparency", "community relations", "teacher contract"], "comment": "Hello School Board, thank you for your time and work. It's such important work you do.\nI'm extremely concerned and upset with the lack of professionalism and the malice the district has shown toward its partner, BEA. It's crucial that we work together to create a positive environment for our staff, families, and students.\nAs a community member, a mother of two, and the PTO VP at a Beaverton elementary school, I find it unacceptable that a platform was used for communication in a way that excluded BEA from responding. The decision not to share this on social media further isolates the community from being able to weigh in.\nIt's clear that some representatives on the district bargaining team need to step aside for more level-headed individuals. The district should have sought mediation sooner instead of blaming BEA for the situation. We need to act like the adults in the room and prioritize collaboration over conflict.\n"}, {"id": "2024-10-08_Andrew_Lamkin", "date": "2024-10-08", "first_name": "Andrew", "last_name": "Lamkin", "association_with_bsd": "Parent/Guardian", "sentiment": "Positive", "topics": ["teacher compensation", "teacher retention", "staff recognition"], "comment": "We have amazing and dedicated teachers in our district.\nIn every other profession salary increases are how we reward performance and dedication to retain talent.\nPlease take a chance and make BSD a shining example of how we should retain great teaching talent.\n"}, {"id": "2024-10-08_Corey_Moeller", "date": "2024-10-08", "first_name": "Corey", "last_name": "Moeller", "association_with_bsd": "Parent/Guardian", "sentiment": "Positive", "topics": ["teacher support", "staff appreciation", "strike concerns", "teacher contract"], "comment": "We love and appreciate our teachers and staff. They deserve more and I am here to help support. A strike would clearly affect so many families negatively, we need them to agree asap\n"}, {"id": "2024-10-08_Patricia_S", "date": "2024-10-08", "first_name": "Patricia", "last_name": "S", "association_with_bsd": "Parent/Guardian", "sentiment": "Negative", "topics": ["class size", "district transparency", "Cedar Mill Elementary", "Tumwater Middle School", "data concerns"], "comment": "The \"average\" class size document put out by BSD is misleading! I have a 5th grade student at Cedar Mill and she has consistently had between 27-3 students in her classes throughout her years at Cedar Mill. This school year there are 29 in one classroom and 30 in the other. Parents had to watch kindergarten, 2nd, 3rd, and 4th grade classes get an additional teacher, bringing those class sizes down however, 5th grade remains at 30.\nTumwater Middle school had well over 35 students in core classes. The 6th grade language arts l, math, social studies and science classes are at 36. Elective teachers(choir, band) have 55 students in some classes and are capped at 60!\nClass sizes are huge and the district is trying to pretend they're not! Parents do not know the reality of class sizes and the district isn't being transparent\n"}, {"id": "2024-10-08_Heidi_Gentry", "date": "2024-10-08", "first_name": "Heidi", "last_name": "Gentry", "association_with_bsd": "Parent/Guardian", "sentiment": "Positive", "topics": ["teacher compensation", "benefits package", "teacher contract", "union negotiations"], "comment": "Please hold strong on your negotiations. As a former teacher, I feel that teachers do not realize how well they are compensated. They tend to lose sight of their total comp package including doing a break down of their true hourly rate for actual hours worked, full benefits package and PERS. When they claim they are not compensated well enough, it's actually insulting to the majority of the working families they have in their classrooms. I will admit, I had that same mentality that was being communicated by the union. Once I changed careers, it became very clear that teachers have it way better than they realize. They are more than fairly compensated and taken care of (especially in BSD).\n"}, {"id": "2024-10-08_Jess_O'Donnell", "date": "2024-10-08", "first_name": "Jess", "last_name": "O'Donnell", "association_with_bsd": "Parent/Guardian", "sentiment": "Positive", "topics": ["teacher support", "student enrollment", "community investment", "teacher contract"], "comment": "Our teachers are the backbone of belong, believe, achieve. They relationships they form are crucial to student enrollment. Invest in our community by investing in our teachers. We support their bargaining efforts.\n"}, {"id": "2024-10-08_Porsche_Turner", "date": "2024-10-08", "first_name": "Porsche", "last_name": "Turner", "association_with_bsd": "Parent/Guardian", "sentiment": "Negative", "topics": ["teacher compensation", "mega schools", "community schools", "transparency", "teacher contract"], "comment": "Dear BSD Board Members,\nI strongly support prioritizing a living wage for our educators, who are vital to our community and deserve compensation that reflects their role in shaping our children's futures.\nI'm opposed to the plan for a mega school, which diverts massive funds away from smaller, more intimate community schools that foster strong connections and personalized education. Instead, we should invest in supporting educators and rebuilding the schools already at the heart of our neighborhoods. Closing them would weaken our communities.\nThe lack of transparency in this process is frustrating, and we will remember this come election time. Please reconsider, focusing on both the well-being of our educators and students.\nDo better!\nThank you,\nPorshe Turner\n"}, {"id": "2024-10-08_Amy_Grey", "date": "2024-10-08", "first_name": "Amy", "last_name": "Grey", "association_with_bsd": "Staff Member", "sentiment": "Negative", "topics": ["district communication", "teacher contract", "working conditions", "ParentSquare", "transparency"], "comment": "The message sent to the community on ParentSquare was appalling and untrue. BEA has been trying to bargain in good faith since the very beginning and BSD has done nothing but drag their feet and make offers that are a slap in the face. Please come to the classroom and spend sometime there. See what we are dealing with. See the resources we need. See how hard we work. See how much of our lives we give to this job. See how you can really support us because THAT is what is best for students and staff. Teachers are not the enemy here. All we want is fair pay, safe working conditions, and the ability to give our students what they truly need. Teachers are the experts. Trying to pin parents against teachers by publishing straight propaganda is a new level of low. The community should know that your infographics are skewed and the language you chose was intended to make staff look like the problem. It's sickening to see how little we are valued.\n"}, {"id": "2024-10-08_Mindy_Hearn", "date": "2024-10-08", "first_name": "Mindy", "last_name": "Hearn", "association_with_bsd": "Parent/Guardian", "sentiment": "Positive", "topics": ["teacher contract", "teacher compensation", "education quality", "cost of living"], "comment": "I am very concerned that a contract has not been settled yet between our teachers' unions and the school board. As educators of our children, we entrust our teachers with the academic, social, and emotional wellbeing of our children. They engage in this with passion and integrity. Their work is the bedrock of not only our childrens' individual futures, but will shape the future of our local communities and how our children someday participate in our larger global community. As such, they deserve commensurate compensation for this most important work. They deserve to earn a wage that supports their own wellbeing. We are all aware that the cost of living has increased dramatically since 2020. As a member of the community that has consistently voted for school bonds in this county, I hope that these funds help provide appropriate wages for our teachers. I urge the school board to treat our teachers with the respect they deserve at the bargaining table and find a way forward. Thank you.\n"}, {"id": "2024-10-08_Cherise_Arthur", "date": "2024-10-08", "first_name": "Cherise", "last_name": "Arthur", "association_with_bsd": "Other Community Member", "sentiment": "Negative", "topics": ["district leadership", "staff support", "student discipline", "school safety", "staff concerns"], "comment": "I want to share my comments and concerns regarding the current status of teachers and classified staff. I don't remember in my 19 years with the district negotiations being so hard to get to a yes for what is best for district and staff. I don't think you have any idea what it is like to work in a public school yet you sit as a board that was elected by our community to do what is best for the education of our students. I would like you to know I feel that in the past two years things have really changed with admins being asked to leave and others leaving because of current management. Please think about the students and our community and your legacy of being on the school board. We expect to be able to send our students to school and do well in safe environment. Pushing kids through to get your graduation rates higher is a disservice to the student and our community. We can do so much better and I am asking you to think about your decisions. We need a fair contract for staff.\n"}, {"id": "2024-10-08_Elizabeth_R.", "date": "2024-10-08", "first_name": "Elizabeth", "last_name": "R.", "association_with_bsd": "Parent/Guardian", "sentiment": "Negative", "topics": ["district communication", "teacher contract", "ParentSquare", "mediation", "attendance policies"], "comment": "I am a BSD parent and I support BEA!\n1. Bargaining: BSD's communication to families via ParentSquare arguing its bargaining position and announcing its unilateral decision to end open bargaining and move to closed mediation was incredibly inappropriate and misleading. It should have been a press release, not a ParentSquare communication. Additionally, the linked materials are, frankly, insulting to the teachers BSD should be trying to retain.\n2. Attendance: BSD's communications about the importance of attendance should address disease mitigation - for example, students and staff who are sick should be strongly encouraged to wear masks at school so they don't get others sick. It's wild to see the emphasis on attendance without any mitigations for transmission of upper respiratory viruses, and frustrating for families like mine whose students have been absent because they caught upper respiratory viruses at school.\n"}, {"id": "2024-10-08_Dawn_Singer", "date": "2024-10-08", "first_name": "Dawn", "last_name": "Singer", "association_with_bsd": "Parent/Guardian", "sentiment": "Negative", "topics": ["district transparency", "staff support", "communication concerns", "PTO coalition", "teacher contract"], "comment": "BSD must commit to transparency from the outset of discussions that impact our schools, staff, and community—not just when it's convenient or when PTOs start sharing information. Waiting to communicate and then presenting misleading, negative narratives about our educators erodes trust and respect. Our teachers should never be vilified for choices made by district leadership. The \"working conditions\" of our staff that you don't want to fully fund are our children's learning conditions. The Beaverton School District PTO Coalition stands firmly in support of our educators. BSD must take accountability for its repeated cancellation of bargaining sessions and unwillingness to support our educators rather than deflecting blame, complaining about educator expectations. With a 1.8 billion dollar budget there are no excuses. Do better for the people who actually matter in BSD. You have no district without them, and without us. There is however, still a district without YOU. WE are BSD.\n"}, {"id": "2024-10-08_Michelle_McCracken", "date": "2024-10-08", "first_name": "Michelle", "last_name": "McCracken", "association_with_bsd": "Other Community Member", "sentiment": "Negative", "topics": ["mega schools", "Raleigh Hills Elementary", "Raleigh Park Elementary", "community schools", "transparency"], "comment": "As a 33 year veteran teacher, I adamantly oppose the \"mega-school\" model in BSD elementary schools. So many studies have shown that small school settings allow children to achieve and build confidence. Why would BSD build Raleigh Hills as a mega school knowing these facts & then hide it from the community? My adult daughters flourished at the small elementary school, Raleigh Park, which offered not just a solid school experience, but a local library, swim center, and community park. This change in approach is so disappointing & discouraging. All I hope is that the district will reconsider the move toward tge \"mega-school\" model.\n"}, {"id": "2024-10-08_Travis_Arnzen", "date": "2024-10-08", "first_name": "Travis", "last_name": "Arnzen", "association_with_bsd": "Parent/Guardian", "sentiment": "Negative", "topics": ["district communication", "teacher contract", "ParentSquare", "community respect"], "comment": "I am extremely disappointed that the district would use ParentSquare as a political tool to try to put parents against educators. The district was completely out of line. This is not how you gain the respect of the community.\n"}, {"id": "2024-10-08_Andi_Luke", "date": "2024-10-08", "first_name": "Andi", "last_name": "Luke", "association_with_bsd": "Parent/Guardian", "sentiment": "Positive", "topics": ["teacher contract", "staff compensation", "union negotiations", "working conditions"], "comment": "I'm writing in support of the BEA members in their union negotiations with BSD. As a Beaverton resident, taxpayer, and homeowner in the Beaverton School District, quality public education is important to me. As a parent of schoolchildren, quality public education is imperative. The dedicated & amazing teachers and staff deserve pay increases, and their working conditions are obviously our children's learning conditions.\nAs a parent and taxpayer, I encourage you to meet the needs of teachers and accept the contract proposal.\n"}, {"id": "2024-10-08_Tiffany_Mathes", "date": "2024-10-08", "first_name": "Tiffany", "last_name": "Mathes", "association_with_bsd": "Parent/Guardian", "sentiment": "Positive", "topics": ["teacher contract", "staff compensation", "teacher expertise", "cost of living", "working conditions"], "comment": "I am writing to express my strong support for a fair teacher's contract. Our educators are dedicated professionals that deserve our respect and recognition for their expertise.\nMy own children have experienced the love and support of their teachers throughout their time at West TV. This nurturing environment not only fosters a love for learning but also builds confidence in our kids.\nIt is crucial that we address the need for a cost of living increase. Teachers are facing rising expenses, and their compensation should reflect their commitment and the realities of living in our community. it's important to remember that the working conditions of our educators directly impact student learning conditions. Investing in our teachers ultimately benefits our students and enhances the overall quality of education.\n"}, {"id": "2024-10-08_Phuong_Nguyen", "date": "2024-10-08", "first_name": "Phuong", "last_name": "Nguyen", "association_with_bsd": "Parent/Guardian", "sentiment": "Negative", "topics": ["teacher compensation", "class size", "behavioral support", "staffing needs"], "comment": "Teachers needs a higher pay, smaller classroom size and more support to help with kids with behavioral issues!! Classroom size of 30 kids for elementary school is too big!! We need more teachers!!\n"}, {"id": "2024-10-08_Teryn_LaRue", "date": "2024-10-08", "first_name": "Teryn", "last_name": "LaRue", "association_with_bsd": "Staff Member", "sentiment": "Negative", "topics": ["district communication", "teacher contract", "ParentSquare", "staff support", "working conditions"], "comment": "25 years as an SLP- 21 with BSD and I have never seen anything like the email sent to the community about BEA/staff.\nWhen I think of all the unpaid time, the materials I've purchased out of my own pocket, the treats I've purchased for students, the lunches I've given up to hold social/friendship groups because that was more important to me, the subscriptions I pay for to make sure I'm staying current on the research for my field, the extra professional development I complete on my own time to make sure I am as informed as I can be … and I did all of this knowing I would never be reimbursed financially nor for my time… helping kids be as independent as possible is why I chose this profession and I love seeing them make progress and grow… to be treated like this by the district feels like a giant slap in the face. Thank you to the community members who understand how demanding these jobs are and support our efforts to be the best we can for our students.\n"}, {"id": "2024-10-08_Ashley_Cena", "date": "2024-10-08", "first_name": "Ashley", "last_name": "Cena", "association_with_bsd": "Other Community Member", "sentiment": "Negative", "topics": ["teacher compensation", "staff support", "student needs", "working conditions", "teacher voice"], "comment": "Our students deserve teachers who are compensated fairly and competitively to continue to have highly qualified educators coming to BSD. It is important we LISTEN to our highly qualified educators that are working with students in the classrooms on what they need. Students deserve safe, supportive, inclusive learning environments and I know that teachers and the BEA are working to ensure that happens by focusing on centering teachers voice on what is happening in classrooms. As a former educator in Beaverton it pains me to see what my former colleagues are going through right now, working without a contract and continuing to give everything for their students. Teacher working conditions are student learning conditions.\n"}, {"id": "2024-10-08_Natalie_S.", "date": "2024-10-08", "first_name": "Natalie", "last_name": "S.", "association_with_bsd": "Other Community Member", "sentiment": "Negative", "topics": ["teacher compensation", "teacher retention", "student needs", "staff support", "working conditions"], "comment": "As a Beaverton resident, I urge you to fully support your teachers and their needs. Teachers are leaving the profession in droves, and our students are the ones who are suffering from this loss. A good teacher can make a huge impact on a child, but when teachers can't afford to provide for their own families and our overworked while also being under supported, those amazing teachers often have to make the difficult decision to leave the profession. Let's lead the way in supporting our teachers and show other districts that listening to teachers' needs and concerns is an important step in ensuring an effective learning experience for our students. Teachers give endlessly and are receiving less and less in exchange. We cannot expect to keep the best teachers when they are consistently being asked to do more with less. Please reach a fair deal with the teachers and show them that you know their worth.\n"}, {"id": "2024-10-08_Julia_Mbacke", "date": "2024-10-08", "first_name": "Julia", "last_name": "Mbacke", "association_with_bsd": "Parent/Guardian", "sentiment": "Neutral", "topics": ["water bottle stations", "facility improvements", "bond measures", "infrastructure"], "comment": "There have been several promises in bond measures that have been approved for filtered water bottle filling stations at each of the BSD schools. When will these water bottle filling systems be installed? Why haven't they been installed yet?\n"}, {"id": "2024-10-08_Christine_Meliza", "date": "2024-10-08", "first_name": "Christine", "last_name": "Meliza", "association_with_bsd": "Parent/Guardian", "sentiment": "Negative", "topics": ["community engagement", "small schools", "district transparency", "bond measures", "school closures"], "comment": "Though the district is trying to put on a show that it is \"listening and learning from (the) community,\" the community is not being fooled. Sending an email claiming we will engage together to have \"deep discussions about our values and how those values are reflected in our school buildings\" but then REFUSING to discuss the CURRENT ISSUE ON THE TABLE regarding the closure of several small schools, is absolutely asinine. The community's VALUES are in SMALL COMMUNITY BASED schools. Let's talk now. Stop the obvious delay tactic. We know how we feel and what we need. We need small schools where our children can be known, where studies show our children thrive. The community needs for you to show integrity and listen now. You have lost my trust, and as such have lost my vote. You've also lost my support to pass any Beaverton School District Bond measure, because you have lied about how you will use my money. I'll encourage my community to vote no against BSD bond measure in the future.\n"}, {"id": "2024-10-08_Lisa_Thompson", "date": "2024-10-08", "first_name": "Lisa", "last_name": "Thompson", "association_with_bsd": "Parent/Guardian", "sentiment": "Negative", "topics": ["district values", "teacher contract", "community engagement", "district communication"], "comment": "As a BSD parent, I am concerned about the mis-alignment of the district's stated values and its actions. Your update on contract negotiations states your commitment to keeping students at the forefront of every decision. Your call to move negotiations to mediation, the tone of your messaging to the BSD community and the website that demonize license staff (the exact roles you note as being vital) requests does not reflect that value. I urge you to listen to the demands of these professionals for how to best serve students. These professionals have spent years earning their credentials and staying up to date through professional development. They refine and hone their expertise everyday. I am not dismissing the budget shortfall. However, your role is to also advocate to local and state leaders for the needs of students and licensed staff. Like staff do everyday, I hope you will also practice collaboration and innovation to find a resolution that equips staff to best serve BSD students.\n"}, {"id": "2024-10-08_Michael_Williams", "date": "2024-10-08", "first_name": "Michael", "last_name": "Williams", "association_with_bsd": "Other Community Member", "sentiment": "Negative", "topics": ["district communication", "teacher contract", "bargaining transparency", "community support"], "comment": "BSD, I'm offended that you think so little of my intelligence and so little of your teachers that you thought that email would work. You don't have my support - the professionals who actually work with our children do. As an alum, voter, and tax payer, I expect you to get back to the bargaining table and make some progress. Be transparent during the bargaining process and allow teachers and community members in the room.\n"}, {"id": "2024-10-08_Allison_B", "date": "2024-10-08", "first_name": "Allison", "last_name": "B", "association_with_bsd": "Parent/Guardian", "sentiment": "Negative", "topics": ["teacher contract", "district leadership", "student needs", "mediation", "transparency"], "comment": "I am disappointed that district leadership did not come to an agreement with Beaverton Education Association's contract requests and that it has now gone to mediation (which is not transparent to the public, like the initial bargaining discussions were). The asks for safe, supportive and inclusive learning environments are vital to our students' learning conditions. Transparency, accountability and shared decision making will lead to better outcomes for our students and educators; the educators in our district know our students and what they need better than anyone does and they should be involved in decisions that impact our students. A commitment to retention and recruitment is critical to ensure our students receive the highest quality education possible. These are not unreasonable requests. Please help to ensure district leadership does everything in their power to meet the needs of our educators and students.\n"}, {"id": "2024-10-08_Erin_H", "date": "2024-10-08", "first_name": "Erin", "last_name": "H", "association_with_bsd": "Parent/Guardian", "sentiment": "Negative", "topics": ["long-term planning", "bond funds", "school closures", "small schools", "Whitford Middle School"], "comment": "As a Beaverton citizen, I am deeply concerned and frustrated by the way BSD is handling long term planning and usage of the bond funds to rebuild Raleigh Hills and shutting down other smaller schools. All data shows us that smaller, community schools are better for student learning, community building and safety. In a world where gun violence is prevalent in schools, shouldn't we be optimizing for smaller community schools? Furthermore, this is a blatant misuse of the Bond funds. Rest assured, myself and a majority of the community members will NOT be supporting any further bonds under this administration. It's a shame and disgrace that you claim to do what's best for the children and community. Clearly that isn't the case. Lastly- Whitford middle school is struggling with bullying, drugs and violence- maybe you should first focus on these real issues?\n"}, {"id": "2024-10-08_Meaghan_M", "date": "2024-10-08", "first_name": "Meaghan", "last_name": "M", "association_with_bsd": "Staff Member", "sentiment": "Negative", "topics": ["teacher contract", "student needs", "staff compensation", "admin salaries", "district funding"], "comment": "Investing in our staff means investing in our students' futures. Student learning conditions are teacher working conditions. For a district that claims to care about students they should prioritize teacher working conditions and give the union the fair contract they deserve. BSD claims the only way to provide a fair contract for the professionals the union represents is by cutting staff positions, specifically cutting programs and positions that provide for our most vulnerable populations of students. However, district admin who do not work directly with students are making several hundred thousand dollar salaries shows where this district's priorities and values lie. Public records show that many district admin have had salary increases over the last couple years. Threatening staff cuts when schools are already understaffed does not promote the inclusivity the district values. It's time BSD puts it money where its mouth is, settle a fair contract and advocate for more state funds.\n"}, {"id": "2024-10-08_Rosanne_Freer", "date": "2024-10-08", "first_name": "Rosanne", "last_name": "Freer", "association_with_bsd": "Parent/Guardian", "sentiment": "Negative", "topics": ["district communication", "ParentSquare", "bargaining", "staff representation"], "comment": "As a parent, and a staff member of the district, I was so disappointed that ParentSquare was used as a communication method by the district to share a very biased view on the bargaining. As a parent, these are not the type of messages I am wanting to receive from leaders of our district. And as an educator, I feel falsely represented to my friends and other parents in the district.\nI really hope the board will take this matter seriously and help the district understand what is and is not proper use of ParentSquare.\n"}, {"id": "2024-10-08_Ginger_Jay", "date": "2024-10-08", "first_name": "Ginger", "last_name": "Jay", "association_with_bsd": "Staff Member", "sentiment": "Negative", "topics": ["district leadership", "working conditions", "district communication", "staff morale", "teacher contract"], "comment": "When I joined the ranks of BSD as a teacher almost 10 years ago, I was so happy and so PROUD. Everyone knew our reputation for being progressive- inclusive and POSITIVE. Teachers seemed to be respected and cared for- People in high level positions LISTENED to the needs and concerns of those doing the HARD WORK in the classrooms. Not now. Behaviors are out of control. Buildings are falling apart and a great number of them DO NOT have working air conditioning- including mine. Programs are adopted and removed (like PLAY centered kindergarten for example) without ANY teacher input. The last few years have been so hard and SO disheartening. But the email sent out to families last week broke my heart. Throwing TEACHERS under the bus and making us look greedy and uncompromising. How could you? Do you have ANY idea what is going on in OUR classrooms? Please rethink your position on the contract negotiations and get make our district on ewe can all be proud of!\n"}, {"id": "2024-10-08_Chris_M", "date": "2024-10-08", "first_name": "Chris", "last_name": "M", "association_with_bsd": "Other Community Member", "sentiment": "Negative", "topics": ["wage disparity", "administrative compensation", "staff funding", "special education", "mental health services"], "comment": "The wage disparity between the highest administrative staff in the Beaverton school district and the district's teachers and staff is shameful. Teachers and other school staff are trying to receive a cost of living wage adjustment and the district does not to seem to want to help ease the lives of the district workers at the cost of their own pockets. It is extremely disheartening when special education, mental health, and the arts staff are the people who are first put on the chopping block for cutting funding. The students are already experiencing an increase in anxiety, depression, and other issues and cutting some of the most important staff members is the district's response? Abhorrent. The union is trying to help not only the teachers and staff but also the students by providing more supportive staff. What's the alternative? Less support staff and less support for the students. I hope the district can reprioritize who they are serving in the community and not themselves.\n"}, {"id": "2024-10-08_Aimee_G", "date": "2024-10-08", "first_name": "Aimee", "last_name": "G", "association_with_bsd": "Staff Member", "sentiment": "Negative", "topics": ["equity", "staff support", "contract negotiations", "district leadership"], "comment": "I have worked in this district for a few years now. In all of those years, our district has prided ourselves in working towards equity and inclusion of all students. However, year after year the demand on the staff at the schools has gotten higher and higher and the compensation and support for the work we do is does not match our efforts. To blame your staff's union for holding back on negotiations is appalling and honestly does not surprise me after I've seen all the broken promises over the years. You cannot claim to be a district of equity when you are not willing to also be equitable to your staff. My students deserve the very best, and I will fight for them.\n"}, {"id": "2024-10-08_Jen_Hunt", "date": "2024-10-08", "first_name": "Jen", "last_name": "Hunt", "association_with_bsd": "Parent/Guardian", "sentiment": "Negative", "topics": ["district communication", "teacher contract", "community relations", "bargaining process"], "comment": "Being a district leadership that works hard to develop the \"WE\" sense around Beaverton schools, I was surprised at the October 3 district communication regarding the ongoing bargaining sessions. For a district that has, in the past, believed that the administration serves the teachers as the teachers serve the community, it was a surprising bad-faith move to put out one point of view without giving an equal pulpit from which the union could respond publicly. Your goal, your only duty, is to create an environment where our teachers can teach and students can learn. I am grateful for state mediation, but I encourage you to be more careful about how publicly you criticize the union. It's not a good look for a district that emphasizes \"WE.\"\n"}, {"id": "2024-10-08_Sam_Golden", "date": "2024-10-08", "first_name": "Sam", "last_name": "Golden", "association_with_bsd": "Student", "sentiment": "Negative", "topics": ["school schedule", "late start", "student jobs", "transportation", "student activities"], "comment": "Late start and BSD is the worst thing you've ever done. high school students have jobs, sports and other things that need an extra hour kids just need to learn how to go to bed an hour earlier as now students are just staying up an hour later I've talked to other students at Westview and they think this is a bad idea. Not to mention District transportation is having a rougher time this year to get everything done. Maybe we can have a vote and see what people think about later start time middle school should be getting out the latest as most kids want an extra hour of sleep then in their lives how is it okay that Elementary is going to be boarding buses in the dark. now with Elementary getting out earlier we have to pay more daycare students can't babysit kids anymore as kids get home earlier. we students have stuff going on after school that needs an extra hour so maybe we should see what the student body wants we have lives so maybe think about going back to last year's HS schedule.\n"}, {"id": "2024-10-08_Adele_Copp", "date": "2024-10-08", "first_name": "Adele", "last_name": "Copp", "association_with_bsd": "Parent/Guardian", "sentiment": "Negative", "topics": ["community relations", "district communication", "teacher support", "teacher contract"], "comment": "Beaverton has always been a strong community, which was proven during Covid. If we have learned anything from that experience we need to work together. It seems like that experience has been quickly forgotten and the teachers and parents are being alienated from the bigger conversation especially with sending that email out last week. It was a complete shock to see the district use its platform to paint the teachers in a bad light. I have chosen to live in Beaverton because of the diversity, the care for community and the schools for my boys. I want my boys to learn to be good community members, which a lot of that is learned through school. The teachers are on the front lines caring, protecting and loving these kids and growing future community members. Please help retain these amazing teachers, gain new teachers and them to teach our children in a safe environment. Give them the tools they are asking for to be successful as they are the ones setting the ground work.\n"}, {"id": "2024-10-08_Brooke_Bruneau", "date": "2024-10-08", "first_name": "Brooke", "last_name": "Bruneau", "association_with_bsd": "Staff Member", "sentiment": "Negative", "topics": ["district communication", "teacher contract", "ParentSquare", "working conditions", "staff support"], "comment": "This is only my 4th year working for BSD. Prior to that I worked in private schools, public schools in other countries, and for public and private corporations. I've never felt so unsupported and thrown under the bus from leadership in my 45 years of working as I did after reading October 3rd's ParentSquare message regarding state mediation. I've never been in an emotionally abusive relationship, but after reading that message I imagine that's what it likely feels like. It was unbelievably skewed against teachers and staff and therefore manipulative. It's disheartening hearing colleagues who've worked for BSD for decades say how difficult teaching has become due to lack of resources and support as well as large class sizes filled with students with disruptive behavior.\n"}, {"id": "2024-10-08_Meghan_Buck", "date": "2024-10-08", "first_name": "Meghan", "last_name": "Buck", "association_with_bsd": "Parent/Guardian", "sentiment": "Negative", "topics": ["district communication", "teacher contract", "transparency", "bargaining process"], "comment": "BSD I'm offended that you think so little of my intelligence and so little of your teachers that you thought that shockingly slanderous email would work. You do NOT have my support - the professionals who actually work with my children do. As a voter and tax payer I expect you to get back to the bargaining table, stop spending so much time on creating elaborate websites and graphs, and make some progress at the bargaining table. Show you meant it when highlighted the need for transparency and keep mediation open to the public. Focus less on the public image you clearly prioritize and work on supporting the students and educators you are hired to support.\n"}, {"id": "2024-10-08_Taylor_Kauffman", "date": "2024-10-08", "first_name": "Taylor", "last_name": "Kauffman", "association_with_bsd": "Staff Member", "sentiment": "Negative", "topics": ["teacher quality", "teacher retention", "district communication", "working conditions", "class size"], "comment": "I want to remind our district leaders that our success comes from high quality teachers. It comes from the individuals who teach our youth each day. Students remember the teachers that made an impact in their lives by showing they cared for them and sparking an interest for them. They don't remember how many high level administrators and executives their school district had. We need to attract and retain quality educators with better working conditions in our schools. The way the district disrespected its teachers recently is appalling. The district says they want high quality education for our students yet they continue to oppose rather than prioritize the needs of students. We know relationships with our students are key and yet we have no support in managing class sizes to be able to better serve our students. We often personally supply our classroom supplies because the funding is tied up in the administration. We are unsupported and unappreciated. PleaseBe transparent in mediation\n"}, {"id": "2024-10-08_Greg_Stiles", "date": "2024-10-08", "first_name": "Greg", "last_name": "Stiles", "association_with_bsd": "Parent/Guardian", "sentiment": "Negative", "topics": ["district leadership", "superintendent compensation", "teacher contract", "union negotiations"], "comment": "I am disheartened by the email sent out by the Superintendent about the financials of the negotiations with the teachers when he is clearly being paid hundreds of thousands and has had substantial raises the last two years, to say the teachers are difficult and undeserving makes my blood boil.\n"}, {"id": "2024-10-08_Kirstan_G", "date": "2024-10-08", "first_name": "Kirstan", "last_name": "G", "association_with_bsd": "Parent/Guardian", "sentiment": "Positive", "topics": ["teacher support", "community relations", "student success", "district leadership", "bond measures"], "comment": "I support our Teachers! As a BSD parent of over 10 years, I have volunteered in our classrooms, on PTO boards and voted yes for every district bond request. We have always supported our schools, and I am now asking that the district support our Teachers.\nOur schools are some of the best in the state… because of our Teachers. Every child deserves the best public education possible and it is our Teachers that deliver on that promise - creating engagement, belonging and academic success for our kids. Teachers are under unrealistic burden to be everything everywhere all at once for our kids and they are only asking to be supported in the work environment to feel safe and fairly compensated. I implore the district to follow its own guiding principles and dedication to WE - remembering our teachers are part of our WE. Why not rally together and push the State to better fund our schools and meet educators needs? Fight WITH our teachers FOR our students- Together.\n"}, {"id": "2024-10-08_Kristine_Napper", "date": "2024-10-08", "first_name": "Kristine", "last_name": "Napper", "association_with_bsd": "Staff Member", "sentiment": "Negative", "topics": ["district communication", "teacher policies", "staff voice", "union contract"], "comment": "I'm deeply offended by BSD trying to make teachers look greedy in messaging to our community. Many of the negotiation issues aren't even about money. I've spent the last several years watching my students suffer due to bad district policies that were made despite teacher opposition. BSD is now trying to take away even more voice and power from teachers in the new contract, and that alone is enough reason for me to fight. My students deserve their teachers' professional expertise, not teachers who mindlessly follow orders from out-of-touch administrators. On the compensation issues, my paycheck isn't keeping up with inflation. I'm doing more work than I've ever done, for less pay that I used to make. It's wrong for the district to ask this, and it isn't greedy for me to say so.\n"}, {"id": "2024-10-08_Paige_Parkinson", "date": "2024-10-08", "first_name": "Paige", "last_name": "Parkinson", "association_with_bsd": "Parent/Guardian", "sentiment": "Positive", "topics": ["safe learning environment", "professional respect", "district transparency"], "comment": "I want a safe, supportive and inclusive learning environment for my students. Our educators deserve professional respect. We deserve transparency from BSD.\n"}, {"id": "2024-10-08_Jen_Janke", "date": "2024-10-08", "first_name": "Jen", "last_name": "Janke", "association_with_bsd": "Staff Member", "sentiment": "Negative", "topics": ["staff safety", "student behavior", "working conditions", "teacher support", "district leadership"], "comment": "I am aware of the personal stories of so many of my colleagues. I know of teachers who have been diagnosed with PTSD due to abuse from dysregulated students. I know of a teacher who required surgery due to an injury from a student, and whose care was not paid for by the district. I received a message from a colleague recently that said, \"I haven't forgotten about planning our meet up for a happy hour. I'll get back to you as soon as I can stop crying.\" Another teacher was videoed by students as they called her disgusting names. She reached out to building security and received no help. All of these teachers have received medical care of some kind due to the nature of their workplaces. None of this is paid for by the district. These are not exaggerations, rather verifiable facts, and not isolated incidents.I am curious to know how the school district squares the message they sent to families stating that teachers are being unreasonable with our financial request in light of these facts.\n"}, {"id": "2024-10-08_Catherine_Leupp", "date": "2024-10-08", "first_name": "Catherine", "last_name": "Leupp", "association_with_bsd": "Parent/Guardian", "sentiment": "Negative", "topics": ["district communication", "ParentSquare", "teacher contract", "class size", "misleading data"], "comment": "I am a concerned parent in the community with 3 students in BSD schools, 2 of whom have special needs. After reading the message that BSD sent via Parent Square on October 3rd, I was alarmed. The post presented a biased and one-sided opinion, portraying the teachers and BEA as unreasonable. BSD provided misleading data in their description of the negotiations. For example, as an example of working conditions, BSD claimed the average class size for 3rd-5th grade is 24 students. We all know that without a firm class size limit, class size can vary greatly school to school and year to year. My son's 3rd grade class had 32 students, which was detrimental for the vulnerable students in the class. In addition, the use of ParentSquare, the communication app that is sanctioned for teacher-parent communication, to promote the opinions of the school district was completely inappropriate. I support our teachers and their reasonable requests. We need class size limits and better pay for teachers.\n"}, {"id": "2024-10-08_Ashley_Gannett", "date": "2024-10-08", "first_name": "Ashley", "last_name": "Gannett", "association_with_bsd": "Parent/Guardian", "sentiment": "Negative", "topics": ["district communication", "teacher support", "safe learning environment", "student needs"], "comment": "Your recent post throwing out teachers under the bus has just proven what I already knew. You are for the district and not for our kids and teachers. Our teachers and students endure everyday more than any of you would tolerate or could handle, and this is supposed to be a safe learning environment. To say that is where I send my child everyday is a stretch. Our district has failed our community in so many ways it is time to set the standard way higher and give our teachers and students what they need to thrive. People are continuing to pull their students from your district, that should be eye opening enough in itself. If you are for our schools, teachers and students that show it with actions not words. DO BETTER BSD and listen to the parents and teachers. That is why you have a job!\n"}, {"id": "2024-10-08_Katherine_Wu", "date": "2024-10-08", "first_name": "Katherine", "last_name": "Wu", "association_with_bsd": "Parent/Guardian", "sentiment": "Negative", "topics": ["school closures", "public lands", "community schools", "district leadership", "bond measure"], "comment": "Board Members, please put a decisive end to the scheme of closing and decommissioning schools. You must figure out a way to keep all of our long-standing schools open. Further, they must also remain in the hands of the public in perpetuity, never to be sold to private developers. Doing all of this is a major betrayal to our community and future generations. Act now, the future is in your hands. Please make sure district administration is fully overseen and are acting in the public interest, not trying to literally dismantle our schools to save some money. It is up to you to reverse course and put a stop to this terrible plan. Closing, decommissioning and selling off public school campuses would cause far more damage to Beaverton S.D. families and the community than the supposed savings are worth. Don't waste all the money and time put into improving these schools over the years only to come through and destroy it shortly afterward (Merle Davies!). Please, don't close our schools!\n"}, {"id": "2024-10-08_Jessica_Clark", "date": "2024-10-08", "first_name": "Jessica", "last_name": "Clark", "association_with_bsd": "Parent/Guardian", "sentiment": "Negative", "topics": ["student safety", "room clears", "student behavior", "district support", "classroom incidents"], "comment": "I am a Beaverton teacher, today I am standing up as a Beaverton parent. Parents want to know that their children are safe when they go to school. The district has put up fences and spent unbelievable amount of money on new software To make sure that all adults coming into the school are safe. However, they refuse to spend funds to support the students who need support when they are feeling dysregulated. My son has had six room clears this year- six times they have had to leave the classroom because of violence, six times They had to miss out on learning, six days where students felt unsafe. I have been notified zero times by the administration at the building.\nThe district can help to solve this problem by making sure that schools, teachers, and students have the support that they need when students are becoming dysregulated.\nFor 10 years, I have been slapped, hit kicked and bit But when my son says mommy, it's scary to watch the teachers and kids get hurt.\" It's too much.\n"}, {"id": "2024-10-08_Katrina_Flasch", "date": "2024-10-08", "first_name": "Katrina", "last_name": "Flasch", "association_with_bsd": "Staff Member", "sentiment": "Negative", "topics": ["teacher quality", "teacher retention", "district communication", "working conditions", "class size"], "comment": "I have been a middle school teacher in BSD for nearly a decade. I am passionate about teaching and all I want is to do a good job. Over the last four years BSD has made decisions that have eroded my ability to teach well. When I first started in this district I had 90 students and 80 minutes of plan time everyday. With that plan time I was able to collaborate with colleagues, communicate to families, create diverse and engaging curriculum, provide meaningful feedback on assessments, grade and return assessments in a timely manner, and so much more. Every year I have more and more students and less and less time for planning. I cannot get to know my students. I cannot tailor my lessons to their needs, I don't have time to write feedback on assessments, or create new and exciting curriculum. I am a worse teacher now than I was 4 years ago. My students don't get the same level of support, attention, or quality of education. Teachers need to be included in decision making.\n"}, {"id": "2024-10-08_Nikki_Suydam", "date": "2024-10-08", "first_name": "Nikki", "last_name": "Suydam", "association_with_bsd": "Staff Member", "sentiment": "Negative", "topics": ["district communication", "ParentSquare", "teacher contract", "staff support", "working conditions"], "comment": "I have been a middle school teacher in BSD for more than 20 years, and I have never felt so exhausted, disheartened, and devalued as I do this year. As with previous years, Central Office has added to our workload, this year by creating the labor-intensive WIN class, by inundating our classes with mainstreamed special needs students—with little/no support—and by cutting our classroom and school budgets so that we must spend more out-of-pocket in order to do our jobs. Now the district—in a display that would have earned one of our students an R in the Digital Citizenship Behavior Learning Target—has demonstrated its utter contempt for us by using the district communication platform to send fallacious information about us to the community. Claiming to value teachers while simultaneously spreading falsehoods demonstrates lack of respect for teachers, not just as professionals, but as fellow human beings. The moral bankruptcy from district leadership is appalling.\n"}, {"id": "2024-10-08_Alex_J", "date": "2024-10-08", "first_name": "Alex", "last_name": "J", "association_with_bsd": "Parent/Guardian", "sentiment": "Negative", "topics": ["student safety", "educator support", "district leadership", "working conditions", "classroom resources"], "comment": "It's unacceptable that BSD continues to neglect the needs of our educators, who are struggling to provide a quality education despite a complete lack of support. These teachers show up for our children, yet the board fails to show up for them. Underfunded classrooms, unreasonable workloads, and inadequate pay have created an environment where our educators are constantly stretched to their limits. The board's refusal to address these issues directly harms not only our teachers but also our students, who depend on them to succeed. Our educators remain committed, but without the necessary resources and respect from the district, how long can they continue to endure this mistreatment? This neglect is shameful, and it is our children who ultimately pay the price. The board's failure to act is a failure to prioritize the well-being and future of our community. It's time BSD steps up now and supports the people who are at the heart of our schools or we need a new board and superintendent.\n"}, {"id": "2024-10-08_Perry_Cohen", "date": "2024-10-08", "first_name": "Perry", "last_name": "Cohen", "association_with_bsd": "Staff Member", "sentiment": "Negative", "topics": ["district transparency", "employee satisfaction", "propaganda concerns", "teacher support", "district leadership"], "comment": "Please release the statistics connected to the forbes employment satisfaction survey that district admin keeps citing as a negotiating chip. According to the methodology forbes used, the survey results may not even reflect the opinion of a current employee. Why is the district attempting to use propaganda to persuade teachers that they are alone in their concerns? Why does the district feel that alienating dissatisfied educators is the way to address failures in leadership? Does the district think so low of their educators and community that they believe we are susceptible to propaganda? Or do the district leaders not realize they are engaging in such propaganda? Why would we have any faith in our leadership when they actively attempt to gaslight their employees?\n"}, {"id": "2024-10-08_Kyle_S", "date": "2024-10-08", "first_name": "Kyle", "last_name": "S", "association_with_bsd": "Staff Member", "sentiment": "Negative", "topics": ["bargaining process", "district communication", "mediation", "union negotiations", "bargaining delays"], "comment": "I am curious why the district has moved to mediation while claiming that the union is holding up negotiations, especially given that the district has refused to come prepared to numerous bargaining sessions with their own proposals or counterproposals (causing extensive delays) and refused to provide adequate amounts of food or accommodate dietary needs when they're providing meals (causing extensive delays). These struggles have gone on for months, and yet the district chose to push messaging to the entire BSD community setting the blame at the feet of the union for 'revers[ing] progress'. I am curious what systems of accountability the district has in place to take responsibility for its numerous failures throughout the bargaining process. I'm also curious on how they intend on making things right after choosing to sabotage negotiations for 150 days and then tell our community that the union isn't bargaining in 'good faith'. Where is the district's good faith? We haven't seen it yet.\n"}, {"id": "2024-10-08_Katrina_Stein", "date": "2024-10-08", "first_name": "Katrina", "last_name": "Stein", "association_with_bsd": "Parent/Guardian", "sentiment": "Positive", "topics": ["teacher compensation", "class size", "staff support", "academic excellence"], "comment": "As the daughter of a public elementary school teacher, I have always held teachers in high regard. I watched my mother pay hundreds of dollars out of her own pocket to provide necessary supply to her classroom, as well as share rooms with other teachers because the school didn't have enough classrooms to accommodate all students. Luckily she had a 20:1 ratio for most of her teaching career and I saw the immense benefit of this for ensuring all students had proper attention to be successful academically.\nI support Beaverton teachers in their ask for cost of living adjustments and lowering of class sizes to ensure the academic excellence of our school district remains strong in the face of rising costs and inflation.\n"}, {"id": "2024-10-08_Luke_Martin", "date": "2024-10-08", "first_name": "Luke", "last_name": "Martin", "association_with_bsd": "Staff Member", "sentiment": "Negative", "topics": ["teacher workload", "after-school programming", "staff retention", "district support"], "comment": "I am an excellent teacher who works above and beyond for my students. I feel like I am drowning in meetings and pointless busy work. I am usually a positive person, but this year I am struggling and looking for work in other districts. In the past I have been able to offer an afternoon culinary club for students (last year about 160 signed up), but this year that is impossible due to the amount of work I am having to take home at night and on the weekends. This is not okay.\n"}, {"id": "2024-11-12_Morgan_Bean", "date": "2024-11-12", "first_name": "Morgan", "last_name": "Bean", "association_with_bsd": "Student", "sentiment": "Negative", "topics": ["teacher contracts", "grading"], "comment": "My teachers are working without a contract, which is crazy to even comprehend. All of my teachers are\nincredibly well-educated instructors who deserve the pay and any other requests they have. I have also\nbeen suffering as a student because of the lack of contract. My teacher's havent been able to grade my\nassignments and I have no idea where I stand grade-wise in all of my classes. The semester is coming to\nan end, and I have no idea how/where to improve, because even when teachers grade, they are doing it\nvery condensed and give minimal feedback! Please give teachers what they are asking for, so students\ncan improve academically.\n"}, {"id": "2024-11-12_Victor_Colon", "date": "2024-11-12", "first_name": "Victor", "last_name": "Colon", "association_with_bsd": "Student", "sentiment": "Negative", "topics": ["teacher contracts", "school environment"], "comment": "Teacher and student deserve new and improved work contracts. Teacher shouldn't be working with out\na contract. Both students and teachers deserve safer and inclusive learning environments. Schools\nneed more funds for support teachers. This situation must be addressed\n"}, {"id": "2024-11-12_Allison_Coburn", "date": "2024-11-12", "first_name": "Allison", "last_name": "Coburn", "association_with_bsd": "Parent/Guardian", "sentiment": "Advocating", "topics": ["unified sports", "equity"], "comment": "Unified Basketball is more than a club; it is a vital sport that fosters inclusion, friendships, and\nstrengthens our school community. Despite its importance, Unified Sports do not receive equitable\nfunding and support compared to NT sports. BSD relies on staff volunteers to provide opportunities for\nstudents with disabilities, which is inequitable & discriminatory. I advocate for improved support and\nresources for Unified Sports across our District including equitable compensation for coaches,\nincreased access to practice facilities and equipment, and a fair share of the BSD athletic budget. These\nresources are essential for creating a meaningful and sustainable experience for our athletes and\npartners. I urge BSD to develop a program to support Unified Sports, starting with financial backing to\nensure equitable compensation for staff and sustainable opportunities for all students with disabilities.\nBy doing so, we can create an inclusive environment where our kids can thrive. Thanks.\n"}, {"id": "2024-11-12_Ana_Carmen Lopez", "date": "2024-11-12", "first_name": "Ana", "last_name": "Carmen Lopez", "association_with_bsd": "Parent/Guardian", "sentiment": "Urgent", "topics": ["school closures", "public education"], "comment": "Board members, we need your leadership now more then ever. With the recent election the new ruling\nparty will most certainly work to dismantle public education, what we've been fighting to build up and\nimprove for decades. Now more than ever is the time to *definitively* put a stop to sinister plans of\nclosing and demolishing schools and selling the properties to real estate developers. This scheme plays\nright into the hands of people trying to destroy our public education system. My family and neighbors\ndeserve to know that our neighborhood schools are safe from being taken away from us by the same\npeople we elected to defend them. Keep our schools open, standing and publicly owned! We are\ncounting on you to reverse course and direct the BSD administration and long range planning group to\nreverse course and put a real end to discussions to close, destroy and sell off our schools! We need you\nnow more than ever to defend our schools and protect our communities from being dismantled.\n"}, {"id": "2024-11-12_Mamiko_Garvey", "date": "2024-11-12", "first_name": "Mamiko", "last_name": "Garvey", "association_with_bsd": "Staff Member", "sentiment": "Urgent", "topics": ["special education", "staffing", "student safety"], "comment": "This is my second submission this school year on the issue of understaffing. I urge all BSD board\nmembers now to really open your ears about unsupported and unsafe environment my team work in.\nMany SPED staff in other buildings are feeling the same work stress.\nIn my building, subs (both certified and classified) for Independent Skills Center (ISC) program are hard\nto come by not because of the severity of our students' special needs but because of poor work\nenvironment and lack of training. Many don't return and many unknowingly ignite or fuel student\ndysregulation.\nSPED administration acknowledges those students with severe behavioral needs in our classrooms but\ncontinues to misplace more students to our rosters while providing no additional support to the\nprogram. Many students witness violences and even student basic needs such as bathrooming go\nunmet daily. It is degrading and is risking student dignity.\nI would love an opportunity to share more in details. Thanks\n"}, {"id": "2024-11-12_Angela_Smith-Lund", "date": "2024-11-12", "first_name": "Angela", "last_name": "Smith-Lund", "association_with_bsd": "Parent/Guardian", "sentiment": "Suggestion", "topics": ["curriculum", "civics education"], "comment": "I'm unsure when the next school board meeting is, hopefully someone with school district will read my\ncomment and take to heart what I have to say. Our kids desperately need civics and government classes\nat all levels (K-12). I hope that BSD will review the current school curriculum and seriously consider\noffering comprehensive (an entire semester) yet age appropriate classes teaching our children how\ngovernment functions at all levels. Our children our ignorant as to how government work, especially at\nthe federal level.\n"}, {"id": "2024-11-12_Lauren_Goemaat", "date": "2024-11-12", "first_name": "Lauren", "last_name": "Goemaat", "association_with_bsd": "Staff Member", "sentiment": "Advocating", "topics": ["teacher contracts", "cost of living"], "comment": "In an uncertain future, it is more important than ever that we support our students, teachers, and staff.\nBeaverton School District needs to demonstrate to teachers that they are valued members of our\nsociety by providing them a fair and reasonable contract. Education is the most important thing we can\nprovide to our community, and you need strong teachers to provide a strong education. BSD needs to\nprotect teacher working conditions which in turn become student learning conditions. BSD needs to\nprotect teacher plan time so that we can focus on supporting our student, developing meaningful\nlessons, and providing valuable feedback. BSD needs to provide a cost of living adjustment that allows\nteachers to live where they work. New staff, who are lower on the pay scale, need to be able to afford\ntheir ever growing rent costs, food costs, healthcare costs. Staff who have reached the top of the pay\nscale also need to be able to afford rising costs. Please support our contract negotiations.\n"}, {"id": "2024-11-12_Lauren_Kelly", "date": "2024-11-12", "first_name": "Lauren", "last_name": "Kelly", "association_with_bsd": "Parent/Guardian", "sentiment": "Concerned", "topics": ["contract negotiations", "school closures"], "comment": "I will keep my comments short and to the point:\nPlease do everything in your power to come to a speedy and fair resolution with BEA and an avoid a\nstrike. Please take notes from PPS and Albany, this is not in the best interest of any involved parties.\nPlease also do everything in your power to keep our neighborhood schools in the SE open. They provide\na vibrant community for not just students but staff and families as well. It cannot be replicated in a 750\ncapacity school. Closing these schools will change our community forever.\n"}, {"id": "2024-11-12_Christine_Meliza", "date": "2024-11-12", "first_name": "Christine", "last_name": "Meliza", "association_with_bsd": "Parent/Guardian", "sentiment": "Negative", "topics": ["class sizes", "teacher support"], "comment": "We need more teachers and smaller classes. Our students are not being served. I know students that\nare highly motivated and actively participate in their learning and also students who are struggling to\nkeep up and getting lost in the mix. BOTH groups are struggling because teachers don't have TIME for\nthem. Thirty students in a classroom is TOO MUCH. In your negotiations, think of the classroom you\nwould want your own children in and help create that experience. Support the front line. The teachers\nare the experts, listen to THEM. They want smaller classrooms and smaller schools. Stop stalling the\nsmaller schools conversations as a way to keep families from having our voice heard. The district is\nmaking choices that are all but pushing our family out of your schools because of the poor decision\nmaking that is happening. Humble yourselves and DO BETTER. LISTEN BETTER.\n"}, {"id": "2024-11-12_Taylor_Kauffman", "date": "2024-11-12", "first_name": "Taylor", "last_name": "Kauffman", "association_with_bsd": "Staff Member", "sentiment": "Advocating", "topics": ["contract negotiations", "planning time"], "comment": "As we approach our mediation session I want to implore you to consider what is best for our teachers\nand students. Please show us that you value us as professionals and our students' quality of education\nby including teachers in the decision making and meeting the needs of all of our staff and students.\nMany things in our bargaining agreement are extremely important to us including but beyond our\nsalaries unlike the messaging you continually push to our community. Our plan time is crucial to\ndeveloping high quality lessons. I would like to call attention to the fact that many teachers work well\nbeyond our contract hours (which is all we are compensated for). Beyond planning our lessons, we also\nmust have time to grade and when our class sizes become extremely large, that increases the time\nneeded to grade their work. It impacts our ability to give meaningful and timely feedback. There are\nonly so many hours in the day, please do not take time away from us, we already have so little.\n"}, {"id": "2024-11-12_Andy_Foeller", "date": "2024-11-12", "first_name": "Andy", "last_name": "Foeller", "association_with_bsd": "Parent/Guardian", "sentiment": "Supportive", "topics": ["public education", "teacher compensation"], "comment": "I'm a father of two young girls in the Beaverton School District. I'm very concerned about the future of\npublic education here in Beaverton and elsewhere. I know that the new incoming administration have\nplans to attack and defund public education. I spent all week thinking about what we can do to change\nour course. I keep coming back to this Martin Luther King quote: \"Darkness cannot drive out darkness,\nonly light can do that. Hate cannot drive out hate; only love can do that.\" The place where we have vast\namount of light and love to give is through educating our children. As caring parents, family, and friends,\nwe already do that, but we need to make sure we start supporting our teachers even more. Their jobs\nbecome even more important and harder starting in January. Let's pay them a just and equitable salary\nthat helps retain and hire good teachers.\n"}, {"id": "2024-12-10_Ashlee_R", "date": "2024-12-10", "first_name": "Ashlee", "last_name": "R", "association_with_bsd": "Staff Member", "sentiment": "Concerned", "topics": ["special education", "program closures"], "comment": "SRCs and ISCs. These classes were supporting some of the highest need students in our district, and\nthere was not a contingency plan to support significant student needs (such as access to a safe room)\nonce other programs absorbed these students-these programs are overflowing.\nFurther, the caseloads for these programs have grown independent from absorbing SLC students,\ncausing high class sizes that are near the levels of gen ed kinder classrooms. While we are grateful that\nBeaverton is working to staff these programs effectively, filling these rooms with more students and\nstaff creates less than optimal learning environments for students with sensory processing difficulties.\nThe caseloads for SLPs and phychs is unsustainable.\nStaff continue to advocate for administration to re-consider an SLC program, open more SRC and ISC\nprograms, and explore site options with safe rooms for students that demonstrate the need for their\nuse.\n"}, {"id": "2024-12-10_Jessi_L", "date": "2024-12-10", "first_name": "Jessi", "last_name": "L", "association_with_bsd": "Staff Member", "sentiment": "Urgent", "topics": ["special education", "staffing"], "comment": "Our Special Education Department is failing our students. Specialized Program classrooms are\novercrowded and under resourced. The effects of closing the SLC program continue to radiate through\nthe ISCs and the SRCs. We need more classrooms to be opened to lower class sizes and more resources\nto be provided to support the intensive needs of our students. Our amazing teachers and Para 2s are\ndoing their best, but we need more of them and more training for them as well. Our specialists are\ndrowning with higher caseloads than they have ever had. Many SLPs and Psychs are considering\nleaving the district due to unmanageable workloads. We need help!\n"}, {"id": "2024-12-10_Emily_Thackray", "date": "2024-12-10", "first_name": "Emily", "last_name": "Thackray", "association_with_bsd": "Staff Member", "sentiment": "Questioning", "topics": ["YSO program", "budget priorities"], "comment": "If there is an emergency and the police are needed at a school, they will arrive. This is what taxpayers\npay for. So, why would the district spend close to one million dollars of BSD funds to pay for only 12\nofficers to work as Youth Service Officers across over 50 BSD schools?\nWill students & schools be less safe if BSD doesn't renew the contracts for & pay for the YSO program?\nWill officers not visit our schools? How can YSO's benefit our school's behavior health & wellness\nsupport services when those services are overstretched & under sourced due to a lack of funds? Our\nschools need full time social workers & more counselors to help students navigate mental health crises,\nacademic stresses & more. Please use taxpayer money wisely & don't use BSD tax funded dollars to\nfund something tax payers already pay for.\nThank you,\nEmily Thackray, ACMA, teacher\n"}, {"id": "2024-12-10_Stephanie_Silver", "date": "2024-12-10", "first_name": "Stephanie", "last_name": "Silver", "association_with_bsd": "Parent/Guardian", "sentiment": "Questioning", "topics": ["BRIC", "community engagement"], "comment": "BSD hired BRIC to run a community engagement process related to schools in the district. However,\nthe community has not heard from these consultants this fall. What is the status on their engagement,\nand how are they ensuring community voices are heard? With $200,000+ of public dollars invested in\nthis engagement, the community demands to have a voice in deciding the future of our community\nschools. You promised engagement, transparency and a way forward that will protect Title schools\nwhich serve our students and communities. Open the doors to this process. The ability to pass future\nbonds depends on it.\n"}, {"id": "2024-12-10_Lauren_McCartney", "date": "2024-12-10", "first_name": "Lauren", "last_name": "McCartney", "association_with_bsd": "Staff Member", "sentiment": "Questioning", "topics": ["YSO program", "equity", "contract negotiations"], "comment": "Why is the district spending close to one million dollars of BSD funds to pay for 12 police officers to\nwork as Youth Service Officers over 50 BSD schools, when we have no control in their training in\nworking with diverse young people, or assessment on their effectiveness of their work? What is the\nplan to change the inequitable reality that Black and LGBTQ+ students disproportionately feel unsafe\nor negative about YSOs?\nPlease support BEA's proposals around compensation, safe learning environment, and professional\nworking conditions because these articles ensure that educators are supported in building successful\ncaring relationships with students that are crucial for their mental health and safety in our schools and\ncommunity. SeeChange's report recommends these relationships, and we all know that it's just basic\nbest practice.\n"}, {"id": "2024-12-10_Erin_Sullivan Shreve", "date": "2024-12-10", "first_name": "Erin", "last_name": "Sullivan Shreve", "association_with_bsd": "Parent/Guardian", "sentiment": "Concerned", "topics": ["school closures", "community schools"], "comment": "I am a McKay parent and am very concerned and sad to hear our wonderful community school may\nclose. This school is integral to our neighborhood. So many kids are able to walk there with friends and\nit was a huge factor in buying our home. While we understand that old buildings can pose risk, we do\nnot understand how building a mega-elementary with a 750 student capacity is even being considered\nright now. The decision to consolidate and shut down these smaller schools was rashly made without\ncommunity involvement. Small classrooms where children can form friendships and get individual\nattention is paramount to student and teacher success. These kids went through COVID isolation to\nclassrooms full of kids. They need time to adjust and develop. Raleigh Hills at 750 kids would be a\nnightmare. And if attendance is down why build beyond what is needed? Not to mention the\nintersection just down the street doesn't need to get any busier. Please consider the safety and\nemotional needs of kids.\n"}, {"id": "2024-12-10_Lora_Dee", "date": "2024-12-10", "first_name": "Lora", "last_name": "Dee", "association_with_bsd": "Staff Member", "sentiment": "Concerned", "topics": ["special education", "SLP workload"], "comment": "I have worked in Beaverton for 8 years as a specialized classroom teacher at the elementary level, in\nthe Structured Routines Classroom. Since the closure of the SLC's, all programs are feeling the rupture\nof losing an entire program. In particular SRC's and ISC's are overflowing, which impacts not only case\nmanagers like myself, but also our itinerant staff such as SLP's, OT's, PT's, and Psych's. When I started in\nBeaverton, my SLP was integral in helping me develop visual supports, communication tools, and\nimplement these to benefit students.\nMy SLP is an amazing, smart, creative, hardworking, and committed educator, but a caseload of 60+\nstudents, with direct services, between two schools, while managing 20 AAC devices, as well as her\npaperwork, is unsustainable. She has also lost her SLP-A's. Our SLP workload committee has\nrecommended a max caseload of 50 for SLP's. This is being disregarded for our SRC and ISC SLP's. We\nwill not retain OR hire good SLP's like this.\n"}, {"id": "2024-12-10_Meaghan_M", "date": "2024-12-10", "first_name": "Meaghan", "last_name": "M", "association_with_bsd": "Staff Member", "sentiment": "Questioning", "topics": ["YSO program", "support staff funding"], "comment": "Why is the district spending close to a million dollars to fund the YSO program when positions such as\ncounselors, psychs, and social workers are still critically underfunded? The district has cut several of\nthese vital positions forcing schools to either do without or make up the FTE for the social\nwork/counselor/psych position. Every school needs a full time psych and a full time social worker. Why\ndoes the district continue to gather community input when the community has been loud and clear that\nYSOs do not make folks feel safer and research backs up that opinion?\nPlease support BEA's proposals around compensation, safe learning environment, and professional\nworking conditions because these articles ensure that educators are supported in building successful\ncaring relationships with students that are crucial for their mental health and safety in our schools and\ncommunity. SeeChange's report recommends these relationships, and we all know that it's just basic\nbest practice.\n"}, {"id": "2024-12-10_April_Powers", "date": "2024-12-10", "first_name": "April", "last_name": "Powers", "association_with_bsd": "Parent/Guardian", "sentiment": "Mixed", "topics": ["contract negotiations", "budget reserves"], "comment": "I hope for an agreement on contract negotiations. While I support our teachers wholeheartedly and\nagree that class sizes are too large, caseloads are too heavy, and many salaries are too low, I don't agree\nwith the BEA proposal that wipes out our reserve funds within a year. These funds are critical as we\nenter the next 4 years, likely with less funding from the federal govt, and that safety net is vitally\nimportant with unpredictable funding from the state. We must spend our reserves wisely and\ncautiously and come to an actual compromise. The district needs a cushion of savings so we aren't\nhiring/firing every year as we live \"paycheck to paycheck\" at the mercy of the state. We need to look at\nwhere we can cut spending (administration at the district level!) and focus on reducing class size for\nALL students. This means more teachers, not fewer. ALL students need smaller classes to have more\nengagement and learn efficiently and effectively, not just those in lower income schools.\n"}, {"id": "2024-12-10_Lauren_Kelly", "date": "2024-12-10", "first_name": "Lauren", "last_name": "Kelly", "association_with_bsd": "Parent/Guardian", "sentiment": "Disappointed", "topics": ["contract negotiations", "Raleigh Hills build"], "comment": "I am a parent of 2 students in Beaverton school district, my children attend McKay Elementary School. I\nsupport our union educators and hope the district can move to a quick resolution in mediation. I am\ndisappointed that negotiations have been this prolonged and stalled. I believe that everyone at the\ndistrict and in our schools has the same goal: support out teachers and students. These protracted\nnegotiations take so much time and energy from everyone involved that could be used in so many\nbetter ways.\nAlso, as a parent impacted by the new Raleigh Hills build, I am disappointed to not have any updates\nfrom Bric or the district. I see an agenda item today pertains to the RH build plans. It says design\noptions have been reviews and will be discussed. A big issue for parents and staff in the spring was\ncommunication and transparency. That seems to still be an issue. Thank you for reading these\ncomments.\n"}, {"id": "2025-01-14_Fernando_Cruz", "date": "2025-01-14", "first_name": "Fernando", "last_name": "Cruz", "association_with_bsd": "Parent/Guardian", "sentiment": "Alarmed", "topics": ["land use", "forest preservation"], "comment": "I'm a Highland Park parent and alumni and this week a land use action notice from the City of Beaverton\nshowed up at the school: LU22024-01018 Highland Park Middle School Partition PP22024-01010. It\nlooks like the school district is dividing the property into two based on the Wilson Avenue boundary. This\nset off alarm bells to myself and I'm sure the many neighbors care for and value the forest at the\nnorthwest corner of the middle school property. In a time when the Beaverton School District is quietly\nplotting to \"decommission\", and likely sell off the school properties to private developers, we have every\nreason to believe the district is selling out our neighborhood by pulling publicly owned land out from\nunder our community's feet. A forest that's been intact longer than the school has been standing should\nnot be sold off just because it's not directly related to the school's functioning. KEEP ALL BEAVERTON\nNEIGHBORHOOD SCHOOLS STANDING and KEEP GROUNDS INTACT!\n"}, {"id": "2025-01-14_Tamarra_Ragland", "date": "2025-01-14", "first_name": "Tamarra", "last_name": "Ragland", "association_with_bsd": "Parent/Guardian", "sentiment": "Disappointed", "topics": ["school closures", "transparency"], "comment": "I am writing to express my deep disappointment with the Beaverton School District's lack of\ntransparency regarding the proposed closure of McKay Elementary School. Many of us, as parents and\ncommunity members, are frustrated and disheartened by the absence of clear communication and\nmeaningful engagement in this process.\nMcKay serves a diverse student body, including 50% children of color, and it is more than just a school—it\nis a vital community anchor. For many students, McKay is a place of safety, belonging, and support.\nClosing it would disproportionately harm those who need it most and fail to meet the needs of our\nchildren.\nThe failure to involve and inform the Beaverton community in a transparent manner is troubling, and the\nongoing disregard for our concerns is unacceptable. We, as parents and community members, are\ndissatisfied with the lack of accountability and the potential harm this decision could cause.\nOur community deserves better, and our children deserve an education\n"}, {"id": "2025-01-14_Mitzi_Sandman", "date": "2025-01-14", "first_name": "Mitzi", "last_name": "Sandman", "association_with_bsd": "Other Community Member", "sentiment": "Questioning", "topics": ["school size", "student success"], "comment": "Regarding discussion on the optimal size of elementary schools in the BSD, it seems most of the data\nfrom BSD is centered around factors such as cost/square foot, or efficiency of bus routes.\nWe have elem schools with <300 students and some nearing 900. Has any qualitative and/or quantitative\nanalysis been done on which school sizes are most effective as it pertains to student success and\nbelonging? Has BSD looked into factors such as reading/math scores, teacher/staff tenure at a school,\nparent participation, community involvement, etc when comparing schools of different sizes? I've heard\nanecdotal stories such of the chaos at lunch and higher educator turnover at the 900 size schools. Does\ncapacity have an effect on the overall sense of belonging, security, and connection each student\nexperiences? As a young elementary student, does having the principal know your name make a\ndifference in the success? These are the questions that should largely guide our Ed Specs and L-R\nplanning.\n"}, {"id": "2025-01-14_Barbara_Weiss", "date": "2025-01-14", "first_name": "Barbara", "last_name": "Weiss", "association_with_bsd": "Staff Member", "sentiment": "Concerned", "topics": ["classified employee pay", "cost of living"], "comment": "As we near bargaining for our classified employees, please remember these things. The price of\npractically everything we pay for, groceries, water!!, auto and homeowners insurance, and the\ndeductibles we pay since our medical insurance plans cover less than they used to, have increased. While\nthe 4.75% COLA we were able to bargain for was welcomed, it actually only increased my paycheck by\n$166 (before taxes), and I'm sure I'm close to the top of the pay scale for a Para II, as this is my 21st year\nin the district. While I have a mortgage, MANY of our classified employees are renting. Rent is increasing\n"}, {"id": "2025-02-11_A_K", "date": "2025-02-11", "first_name": "A", "last_name": "K", "association_with_bsd": "Staff Member", "sentiment": "Negative", "topics": ["wages", "para educators"], "comment": "Para Educators should be paid a liveable wage, single parent household cannot sustain on para salary.\nWith all the demands and toll it takes on mental health just giving COLA is not enough.\n"}, {"id": "2025-02-11_Talya_Sanders", "date": "2025-02-11", "first_name": "Talya", "last_name": "Sanders", "association_with_bsd": "Parent/Guardian", "sentiment": "Negative", "topics": ["overcrowding", "summa program"], "comment": "Summa at Whitford is overcrowded and you must fix this for next year's 6th grade class. Please shift\nwhere Summa students attend the program on the south side of the district.\nProjections anticipate around 45 students enrolling in Whitford's incoming Summa class next year. The\ncurrent 6th and 8th grade classes have proven that is way too many students – just ask the teachers,\nstudents, and principal. That's 45 students piled into one classroom for core classes. This would never be\nallowed in other programs.\nPlease find a way to ensure that Summa classrooms are not overcrowded, the way Whitford's are. There\nactually may be additional benefits for Summa students who have to shift schools, like making friends\nand connections that will follow them to high school (instead of the messy Summa feeder system now in\nplace). While changes like this can be logistically challenging, there are creative solutions out there. You\nowe it to our students and teachers to find and implement them.\n"}, {"id": "2025-02-11_Brian_Bovero", "date": "2025-02-11", "first_name": "Brian", "last_name": "Bovero", "association_with_bsd": "Staff Member", "sentiment": "Negative", "topics": ["staff suspensions", "special education"], "comment": "I am a Para 2 in an Emotional Growth Center in an elementary school and I would like to comment of the\ntopic of suspensions of staff. If a student is suspended, it is usually for a day or two and they are brought\nback in. Sometimes they have a re-entry plan and sometimes they don't. If a staff member is suspended\nthey can be out for weeks and sometimes months, and their position is left filled by untrained substitutes\nor not filled at all. This not only affects the students, but has an even worse effect on the remaining staff\nmembers who are already stretched thin. This has happened three times in the last year in our program\nalone. The first time to staff member was not found at fault, but they were not renewed for this year even\nthough multiple openings occurred. The second time the staff member did not return and we were not\ntold why. It took weeks to replace them. The third time just happened.\n"}, {"id": "2025-02-11_Priyanka_Krishamurthy", "date": "2025-02-11", "first_name": "Priyanka", "last_name": "Krishamurthy", "association_with_bsd": "Parent/Guardian", "sentiment": "Negative", "topics": ["land use", "forest preservation"], "comment": "Don't sell the forest at the northwest corner of Highland Park Middle School or any other neighborhood\nschool land. Board members, why haven't you stopped this? You have the power to end this short-sighted\nand deeply unpopular scheme. Curb your administrators and the facilities long range planning people and\nput a definitive halt to the selling off of public land to real estate developers. We don't want forests and\nschool grounds in our communities to be pulled out from under us due to the egregious plotting of a few\nstaff members. Wake up and do something! We elected you to defend our schools, not take them away!\nWhen the USA federal government is ramping up assaults on public education, now is the time to do your\njob and why we elected you. Put your feet down and take steps to ensure that our school properties are\nnot sold off overtime in favor of mega-elementary schools. The Beaverton School District is acting\ndisgracefully and with no accountability. Fix this now. Don't sell us out\n"}, {"id": "2025-02-11_Mitzi_S", "date": "2025-02-11", "first_name": "Mitzi", "last_name": "S", "association_with_bsd": "Other Community Member", "sentiment": "Constructive", "topics": ["board governance", "accountability"], "comment": "Board members--please understand that a critical part of your role is \"communicating and engaging with\nthe community\" to get the insight and feedback needed in order to \"establish policies that direct\ninstructional and support programs\" and \"determine the long-range direction and vision\" of BSD. You are\nin essence the superintendent's boss, which means the person in that role answers to you as the Board,\nrather than you merely implementing and taking directives from him/her. Your role is not one of\nrubberstamping what is put before you, but one of asking the hard questions and expecting real answers\nwith appropriate details and being tenancious until you get them. I know the role of a Board member isn't\neasy and I absolutely appreciate the enormous amount of work it entails, all unpaid. To that end, please\nmake your contribution as meaningful as possible by being the steel that sharpens steel in making BSD\nthe best it can be for our students, each and every one of them.\n"}, {"id": "2025-02-11_Dawn_Singer", "date": "2025-02-11", "first_name": "Dawn", "last_name": "Singer", "association_with_bsd": "Parent/Guardian", "sentiment": "Negative", "topics": ["budget", "transparency", "BRIC"], "comment": "How is BSD funding new contracts with BRIC when the 2024-25 budget was deemed too small to pay\nteachers fairly? If BSD is in a budget deficit, why hire outside contractors to \"facilitate communication\"\ninstead of engaging directly with the community? Carina from BRIC has even demonstrated hostility to\ncommunity members who are trying to engage in LRFP discussions. BSD is layering contracts onto\nexisting ones to create a false image of \"engagement\" while continuing to make decisions behind closed\ndoors. We see BSD still building Raleigh Hills for 750 students, while they defer real conversations about\nclosures and consolidations until it's \"too late\" for community input \"forcing decisions\" while ignoring the\nvoices they claim to seek. Not to mention discouraging board members from listening to the community\nthey promised to serve, on their own time.\nWhat are you hiding now, BSD? Why cant you communicate directly with the community who so\ndesperately wants to communicate with you?\n"}, {"id": "2025-02-11_Stephanie_Silver", "date": "2025-02-11", "first_name": "Stephanie", "last_name": "Silver", "association_with_bsd": "Parent/Guardian", "sentiment": "Questioning", "topics": ["BRIC meetings", "school closures", "transparency"], "comment": "During the BRIC meetings, facilitators note that \"this is not the forum to discuss potential school\nclosures, or the use of Raleigh Hills school\". Parents want to know: where IS that forum? BRIC will\npresent recommendations to the board in December 2025/Jan 2026, with a quick Board vote to follow.\nFamilies impacted by the recommendations want to know how to be a part of the conversation in the real\nsense, and not just at a theoretical level around high-level values. We want to know where the Board\nstands related to supporting our schools staying open, and what creative solutions you are considering to\nmanage issues like budget shortfalls. Parents want to keep existing elementary schools open to support\nthe best possible education for our children."}]